zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp211axx_cm33.h
/*!< APB3 peripherals Secure aliases */
#define BSEC_BASE_S                         (APB3_PERIPH_BASE_S + 0x000000UL)
#define IWDG1_BASE_S                        (APB3_PERIPH_BASE_S + 0x010000UL)
#define IWDG2_BASE_S                        (APB3_PERIPH_BASE_S + 0x020000UL)
#define IWDG3_BASE_S                        (APB3_PERIPH_BASE_S + 0x030000UL)
#define IWDG4_BASE_S                        (APB3_PERIPH_BASE_S + 0x040000UL)
#define WWDG1_BASE_S                        (APB3_PERIPH_BASE_S + 0x050000UL)
#define VREFBUF_BASE_S                      (APB3_PERIPH_BASE_S + 0x060000UL)
#define DTS_BASE_S                          (APB3_PERIPH_BASE_S + 0x070000UL)
#define SERC_BASE_S                         (APB3_PERIPH_BASE_S + 0x080000UL)
#define HDP_BASE_S                          (APB3_PERIPH_BASE_S + 0x090000UL)
#define DBGMCU_BASE_S                       (APB3_PERIPH_BASE_S + 0x0A0000UL)

/*!< AHB4 peripherals Secure aliases */
#define RCC_BASE_S                          (AHB4_PERIPH_BASE_S + 0x00000UL)
#define PWR_BASE_S                          (AHB4_PERIPH_BASE_S + 0x10000UL)
#define EXTI1_BASE_S                        (AHB4_PERIPH_BASE_S + 0x20000UL)
#define EXTI1_C1_BASE_S                     (EXTI1_BASE_S + 0x80UL)
#define EXTI1_C2_BASE_S                     (EXTI1_BASE_S + 0xC0UL)
#define EXTI1_C3_BASE_S                     (EXTI1_BASE_S + 0x100UL)
#define SYSCFG_BASE_S                       (AHB4_PERIPH_BASE_S + 0x30000UL)
#define GPIOA_BASE_S                        (AHB4_PERIPH_BASE_S + 0x40000UL)
#define GPIOB_BASE_S                        (AHB4_PERIPH_BASE_S + 0x50000UL)
#define GPIOC_BASE_S                        (AHB4_PERIPH_BASE_S + 0x60000UL)
#define GPIOD_BASE_S                        (AHB4_PERIPH_BASE_S + 0x70000UL)
#define GPIOE_BASE_S                        (AHB4_PERIPH_BASE_S + 0x80000UL)
#define GPIOF_BASE_S                        (AHB4_PERIPH_BASE_S + 0x90000UL)
#define GPIOG_BASE_S                        (AHB4_PERIPH_BASE_S + 0xA0000UL)
#define GPIOH_BASE_S                        (AHB4_PERIPH_BASE_S + 0xB0000UL)
#define GPIOI_BASE_S                        (AHB4_PERIPH_BASE_S + 0xC0000UL)
#define EXTI2_BASE_S                        (AHB4_PERIPH_BASE_S + 0xD0000UL)
#define EXTI2_C1_BASE_S                     (EXTI2_BASE_S + 0x80UL)
#define EXTI2_C2_BASE_S                     (EXTI2_BASE_S + 0xC0UL)
#define EXTI2_C3_BASE_S                     (EXTI2_BASE_S + 0x100UL)

/*!< SMART_RUN_APB peripherals Secure aliases */
#define RTC_BASE_S                          (SMART_RUN_APB_PERIPH_BASE_S + 0x00000UL)
#define TAMP_BASE_S                         (SMART_RUN_APB_PERIPH_BASE_S + 0x10000UL)
#define SPI6_BASE_S                         (SMART_RUN_APB_PERIPH_BASE_S + 0x20000UL)
#define LPUART1_BASE_S                      (SMART_RUN_APB_PERIPH_BASE_S + 0x30000UL)
#define I2C3_BASE_S                         (SMART_RUN_APB_PERIPH_BASE_S + 0x40000UL)
#define LPTIM3_BASE_S                       (SMART_RUN_APB_PERIPH_BASE_S + 0x50000UL)
#define LPTIM4_BASE_S                       (SMART_RUN_APB_PERIPH_BASE_S + 0x60000UL)
#define LPTIM5_BASE_S                       (SMART_RUN_APB_PERIPH_BASE_S + 0x70000UL)
#define I3C3_BASE_S                         (SMART_RUN_APB_PERIPH_BASE_S + 0x80000UL)

/*!< SMART_RUN_AHB peripherals Secure aliases */
#define GPIOZ_BASE_S                        (SMART_RUN_AHB_PERIPH_BASE_S + 0x00000UL)
#define ADF1_BASE_S                         (SMART_RUN_AHB_PERIPH_BASE_S + 0x20000UL)
#define ADF1_Filter0_BASE_S                 (ADF1_BASE_S + 0x80UL)

/*!< APB4 peripherals Secure aliases */
#define LTDC_BASE_S                         (APB4_PERIPH_BASE_S + 0x10000UL)
#define LTDC_Layer1_BASE_S                  (LTDC_BASE_S + 0x100UL)
#define LTDC_Layer2_BASE_S                  (LTDC_BASE_S + 0x200UL)
#define LTDC_Layer3_BASE_S                  (LTDC_BASE_S + 0x300UL)
#define DCMIPP_BASE_S                       (APB4_PERIPH_BASE_S + 0x30000UL)
#define DDRC_BASE_S                         (APB4_PERIPH_BASE_S + 0x40000UL)
#define DDRDBG_BASE_S                       (APB4_PERIPH_BASE_S + 0x50000UL)
#define STGENR_BASE_S                       (APB4_PERIPH_BASE_S + 0x70000UL)
#define STGENC_BASE_S                       (APB4_PERIPH_BASE_S + 0x80000UL)
#define ATG_BASE_S                          (APB4_PERIPH_BASE_S + 0x90000UL)
#define BUSPERFM_BASE_S                     (APB4_PERIPH_BASE_S + 0xB0000UL)
#define DDRPERFM_BASE_S                     (APB4_PERIPH_BASE_S + 0xC0000UL)
/*!< AHB5 peripherals Secure aliases */
#define FMC_BASE_S                          (AHB5_PERIPH_BASE_S + 0x000000UL)
#define SDMMC1_BASE_S                       (AHB5_PERIPH_BASE_S + 0x020000UL)
#define SDMMC2_BASE_S                       (AHB5_PERIPH_BASE_S + 0x030000UL)
#define SDMMC3_BASE_S                       (AHB5_PERIPH_BASE_S + 0x040000UL)
#define ETH1_BASE_S                         (AHB5_PERIPH_BASE_S + 0x0C0000UL)
#define USBH_OHCI_BASE_S                    (AHB5_PERIPH_BASE_S + 0x0E0000UL)
#define USBH_EHCI_BASE_S                    (AHB5_PERIPH_BASE_S + 0x0F0000UL)
#define USBDR_BASE_S                        (AHB5_PERIPH_BASE_S + 0x100000UL)
#define CA35SYSCFG_BASE_S                   (AHB5_PERIPH_BASE_S + 0x602000UL)
#define FMC_NAND_DATA_BASE_S                (AHB5_PERIPH_BASE_S + 0x610000UL)
#define DDRPHYC_BASE_S                      (AHB5_PERIPH_BASE_S + 0xA00000UL)


/*!< AHB6 peripherals Secure aliases */
/*!< FMC Banks registers base address */
#define FMC_Bank1_R_BASE_S                  (FMC_BASE_S + 0x0000UL)
#define FMC_Bank1E_R_BASE_S                 (FMC_BASE_S + 0x0104UL)
#define FMC_Bank3_R_BASE_S                  (FMC_BASE_S + 0x0080UL)
#define FMC_Common_R_BASE_S                 (FMC_BASE_S + 0x0020UL)

#endif /* CORTEX_IN_SECURE_STATE */
/**
  * @}
  */
#define TIM2_NS                             ((TIM_TypeDef *) TIM2_BASE_NS)
#define TIM3_NS                             ((TIM_TypeDef *) TIM3_BASE_NS)
#define TIM4_NS                             ((TIM_TypeDef *) TIM4_BASE_NS)
#define TIM5_NS                             ((TIM_TypeDef *) TIM5_BASE_NS)
#define TIM6_NS                             ((TIM_TypeDef *) TIM6_BASE_NS)
#define TIM7_NS                             ((TIM_TypeDef *) TIM7_BASE_NS)
#define TIM12_NS                            ((TIM_TypeDef *) TIM12_BASE_NS)
#define TIM13_NS                            ((TIM_TypeDef *) TIM13_BASE_NS)
#define TIM14_NS                            ((TIM_TypeDef *) TIM14_BASE_NS)
#define LPTIM1_NS                           ((LPTIM_TypeDef *) LPTIM1_BASE_NS)
#define LPTIM2_NS                           ((LPTIM_TypeDef *) LPTIM2_BASE_NS)
#define SPI2_NS                             ((SPI_TypeDef *) SPI2_BASE_NS)
#define SPI3_NS                             ((SPI_TypeDef *) SPI3_BASE_NS)
#define SPDIFRX_NS                          ((SPDIFRX_TypeDef *) SPDIFRX_BASE_NS)
#define USART2_NS                           ((USART_TypeDef *) USART2_BASE_NS)
#define USART3_NS                           ((USART_TypeDef *) USART3_BASE_NS)
#define UART4_NS                            ((USART_TypeDef *) UART4_BASE_NS)
#define UART5_NS                            ((USART_TypeDef *) UART5_BASE_NS)
#define I2C1_NS                             ((I2C_TypeDef *) I2C1_BASE_NS)
#define I2C2_NS                             ((I2C_TypeDef *) I2C2_BASE_NS)
#define I2C3_NS                             ((I2C_TypeDef *) I2C3_BASE_NS)
#define I3C1_NS                             ((I3C_TypeDef *) I3C1_BASE_NS)
#define I3C2_NS                             ((I3C_TypeDef *) I3C2_BASE_NS)
#define I3C3_NS                             ((I3C_TypeDef *) I3C3_BASE_NS)
#define TIM10_NS                            ((TIM_TypeDef *) TIM10_BASE_NS)
#define TIM11_NS                            ((TIM_TypeDef *) TIM11_BASE_NS)

#define TIM1_NS                             ((TIM_TypeDef *) TIM1_BASE_NS)
#define TIM8_NS                             ((TIM_TypeDef *) TIM8_BASE_NS)
#define USART6_NS                           ((USART_TypeDef *) USART6_BASE_NS)
#define SPI1_NS                             ((SPI_TypeDef *) SPI1_BASE_NS)
#define SPI4_NS                             ((SPI_TypeDef *) SPI4_BASE_NS)
#define TIM15_NS                            ((TIM_TypeDef *) TIM15_BASE_NS)
#define TIM16_NS                            ((TIM_TypeDef *) TIM16_BASE_NS)
#define TIM17_NS                            ((TIM_TypeDef *) TIM17_BASE_NS)
#define SPI5_NS                             ((SPI_TypeDef *) SPI5_BASE_NS)
#define SAI1_NS                             ((SAI_TypeDef *) SAI1_BASE_NS)
#define SAI1_Block_A_NS                     ((SAI_Block_TypeDef *) SAI1_Block_A_BASE_NS)
#define SAI1_Block_B_NS                     ((SAI_Block_TypeDef *) SAI1_Block_B_BASE_NS)
#define SAI2_NS                             ((SAI_TypeDef *) SAI2_BASE_NS)
#define SAI2_Block_A_NS                     ((SAI_Block_TypeDef *) SAI2_Block_A_BASE_NS)
#define SAI2_Block_B_NS                     ((SAI_Block_TypeDef *) SAI2_Block_B_BASE_NS)
#define SAI3_NS                             ((SAI_TypeDef *) SAI3_BASE_NS)
#define SAI3_Block_A_NS                     ((SAI_Block_TypeDef *) SAI3_Block_A_BASE_NS)
#define SAI3_Block_B_NS                     ((SAI_Block_TypeDef *) SAI3_Block_B_BASE_NS)
#define USART1_NS                           ((USART_TypeDef *) USART1_BASE_NS)
#define SAI4_NS                             ((SAI_TypeDef *) SAI4_BASE_NS)
#define SAI4_Block_A_NS                     ((SAI_Block_TypeDef *) SAI4_Block_A_BASE_NS)
#define SAI4_Block_B_NS                     ((SAI_Block_TypeDef *) SAI4_Block_B_BASE_NS)
#define UART7_NS                            ((USART_TypeDef *) UART7_BASE_NS)

#define HPDMA1_NS                           ((DMA_TypeDef *) HPDMA1_BASE_NS)
#define HPDMA2_NS                           ((DMA_TypeDef *) HPDMA2_BASE_NS)
#define HPDMA3_NS                           ((DMA_TypeDef *) HPDMA3_BASE_NS)
#define OCTOSPI1_NS                         ((OCTOSPI_TypeDef *) OCTOSPI1_BASE_NS)
#define ICACHE_NS                           ((ICACHE_TypeDef *) ICACHE_BASE_NS)
#define DCACHE_NS                           ((DCACHE_TypeDef *) DCACHE_BASE_NS)
#define IPCC1_NS                            ((IPCC_TypeDef *) IPCC1_BASE_NS)
#define IPCC1_C1_NS                         ((IPCC_CommonTypeDef *) IPCC1_C1_BASE_NS)
#define IPCC1_C2_NS                         ((IPCC_CommonTypeDef *) IPCC1_C2_BASE_NS)
#define DCMI_NS                             ((DCMI_TypeDef *) DCMI_BASE_NS)
#define PSSI_NS                             ((PSSI_TypeDef *) PSSI_BASE_NS)
#define CRC_NS                              ((CRC_TypeDef *) CRC_BASE_NS)
#define MDF1_NS                             ((MDF_TypeDef *) MDF1_BASE_NS)
#define MDF1_Filter0_NS                     ((MDF_Filter_TypeDef*) MDF1_Filter0_BASE_NS)
#define MDF1_Filter1_NS                     ((MDF_Filter_TypeDef*) MDF1_Filter1_BASE_NS)
#define MDF1_Filter2_NS                     ((MDF_Filter_TypeDef*) MDF1_Filter2_BASE_NS)
#define MDF1_Filter3_NS                     ((MDF_Filter_TypeDef*) MDF1_Filter3_BASE_NS)
#define MDF1_Filter4_NS                     ((MDF_Filter_TypeDef*) MDF1_Filter4_BASE_NS)
#define MDF1_Filter5_NS                     ((MDF_Filter_TypeDef*) MDF1_Filter5_BASE_NS)
#define MDF1_Filter6_NS                     ((MDF_Filter_TypeDef*) MDF1_Filter6_BASE_NS)
#define MDF1_Filter7_NS                     ((MDF_Filter_TypeDef*) MDF1_Filter7_BASE_NS)
#define ADC1_NS                             ((ADC_TypeDef *) ADC1_BASE_NS)
#define ADC2_NS                             ((ADC_TypeDef *) ADC2_BASE_NS)
#define ADC1_COMMON_NS                      ((ADC_Common_TypeDef *) ADC1_COMMON_BASE_NS)
#define ADC2_COMMON_NS                      ((ADC_Common_TypeDef *) ADC2_COMMON_BASE_NS)

