zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp211axx_cm33.h
/******************  Bit definition for ETH_ACMMSG_IRQTESTHIGH register  *******************/
#define ETH_ACMMSG_IRQTESTHIGH_Pos          (0U)
#define ETH_ACMMSG_IRQTESTHIGH_Msk          (0xFFFFFFFFUL << ETH_ACMMSG_IRQTESTHIGH_Pos)    /*!< 0xFFFFFFFF */
#define ETH_ACMMSG_IRQTESTHIGH              ETH_ACMMSG_IRQTESTHIGH_Msk                     /*!< IRQ Test high */
#define ETH_ACMMSG_IRQTESTHIGH_0            (0x1UL << ETH_ACMMSG_IRQTESTHIGH_Pos)           /*!< 0x00000001 */
#define ETH_ACMMSG_IRQTESTHIGH_1            (0x2UL << ETH_ACMMSG_IRQTESTHIGH_Pos)           /*!< 0x00000002 */
#define ETH_ACMMSG_IRQTESTHIGH_2            (0x4UL << ETH_ACMMSG_IRQTESTHIGH_Pos)           /*!< 0x00000004 */
#define ETH_ACMMSG_IRQTESTHIGH_3            (0x8UL << ETH_ACMMSG_IRQTESTHIGH_Pos)           /*!< 0x00000008 */
#define ETH_ACMMSG_IRQTESTHIGH_4            (0x10UL << ETH_ACMMSG_IRQTESTHIGH_Pos)          /*!< 0x00000010 */
#define ETH_ACMMSG_IRQTESTHIGH_5            (0x20UL << ETH_ACMMSG_IRQTESTHIGH_Pos)          /*!< 0x00000020 */
#define ETH_ACMMSG_IRQTESTHIGH_6            (0x40UL << ETH_ACMMSG_IRQTESTHIGH_Pos)          /*!< 0x00000040 */
#define ETH_ACMMSG_IRQTESTHIGH_7            (0x80UL << ETH_ACMMSG_IRQTESTHIGH_Pos)          /*!< 0x00000080 */
#define ETH_ACMMSG_IRQTESTHIGH_8            (0x100UL << ETH_ACMMSG_IRQTESTHIGH_Pos)         /*!< 0x00000100 */
#define ETH_ACMMSG_IRQTESTHIGH_9            (0x200UL << ETH_ACMMSG_IRQTESTHIGH_Pos)         /*!< 0x00000200 */
#define ETH_ACMMSG_IRQTESTHIGH_10           (0x400UL << ETH_ACMMSG_IRQTESTHIGH_Pos)         /*!< 0x00000400 */
#define ETH_ACMMSG_IRQTESTHIGH_11           (0x800UL << ETH_ACMMSG_IRQTESTHIGH_Pos)         /*!< 0x00000800 */
#define ETH_ACMMSG_IRQTESTHIGH_12           (0x1000UL << ETH_ACMMSG_IRQTESTHIGH_Pos)        /*!< 0x00001000 */
#define ETH_ACMMSG_IRQTESTHIGH_13           (0x2000UL << ETH_ACMMSG_IRQTESTHIGH_Pos)        /*!< 0x00002000 */
#define ETH_ACMMSG_IRQTESTHIGH_14           (0x4000UL << ETH_ACMMSG_IRQTESTHIGH_Pos)        /*!< 0x00004000 */
#define ETH_ACMMSG_IRQTESTHIGH_15           (0x8000UL << ETH_ACMMSG_IRQTESTHIGH_Pos)        /*!< 0x00008000 */
#define ETH_ACMMSG_IRQTESTHIGH_16           (0x10000UL << ETH_ACMMSG_IRQTESTHIGH_Pos)       /*!< 0x00010000 */
#define ETH_ACMMSG_IRQTESTHIGH_17           (0x20000UL << ETH_ACMMSG_IRQTESTHIGH_Pos)       /*!< 0x00020000 */
#define ETH_ACMMSG_IRQTESTHIGH_18           (0x40000UL << ETH_ACMMSG_IRQTESTHIGH_Pos)       /*!< 0x00040000 */
#define ETH_ACMMSG_IRQTESTHIGH_19           (0x80000UL << ETH_ACMMSG_IRQTESTHIGH_Pos)       /*!< 0x00080000 */
#define ETH_ACMMSG_IRQTESTHIGH_20           (0x100000UL << ETH_ACMMSG_IRQTESTHIGH_Pos)      /*!< 0x00100000 */
#define ETH_ACMMSG_IRQTESTHIGH_21           (0x200000UL << ETH_ACMMSG_IRQTESTHIGH_Pos)      /*!< 0x00200000 */
#define ETH_ACMMSG_IRQTESTHIGH_22           (0x400000UL << ETH_ACMMSG_IRQTESTHIGH_Pos)      /*!< 0x00400000 */
#define ETH_ACMMSG_IRQTESTHIGH_23           (0x800000UL << ETH_ACMMSG_IRQTESTHIGH_Pos)      /*!< 0x00800000 */
#define ETH_ACMMSG_IRQTESTHIGH_24           (0x1000000UL << ETH_ACMMSG_IRQTESTHIGH_Pos)     /*!< 0x01000000 */
#define ETH_ACMMSG_IRQTESTHIGH_25           (0x2000000UL << ETH_ACMMSG_IRQTESTHIGH_Pos)     /*!< 0x02000000 */
#define ETH_ACMMSG_IRQTESTHIGH_26           (0x4000000UL << ETH_ACMMSG_IRQTESTHIGH_Pos)     /*!< 0x04000000 */
#define ETH_ACMMSG_IRQTESTHIGH_27           (0x8000000UL << ETH_ACMMSG_IRQTESTHIGH_Pos)     /*!< 0x08000000 */
#define ETH_ACMMSG_IRQTESTHIGH_28           (0x10000000UL << ETH_ACMMSG_IRQTESTHIGH_Pos)    /*!< 0x10000000 */
#define ETH_ACMMSG_IRQTESTHIGH_29           (0x20000000UL << ETH_ACMMSG_IRQTESTHIGH_Pos)    /*!< 0x20000000 */
#define ETH_ACMMSG_IRQTESTHIGH_30           (0x40000000UL << ETH_ACMMSG_IRQTESTHIGH_Pos)    /*!< 0x40000000 */
#define ETH_ACMMSG_IRQTESTHIGH_31           (0x80000000UL << ETH_ACMMSG_IRQTESTHIGH_Pos)    /*!< 0x80000000 */

/******************  Bit definition for ETH_ACMMSG_MSGBUFSTATUS register  *******************/
#define ETH_ACMMSG_MSGBUFSTATUS_FCS_STATE_Pos    (0U)
#define ETH_ACMMSG_MSGBUFSTATUS_FCS_STATE_Msk    (0x1UL << ETH_ACMMSG_MSGBUFSTATUS_FCS_STATE_Pos)         /*!< 0x00000001 */
#define ETH_ACMMSG_MSGBUFSTATUS_FCS_STATE        ETH_ACMMSG_MSGBUFSTATUS_FCS_STATE_Msk                   /*!< FCS state */
#define ETH_ACMMSG_MSGBUFSTATUS_DSCR_ERR_Pos     (1U)
#define ETH_ACMMSG_MSGBUFSTATUS_DSCR_ERR_Msk     (0x1UL << ETH_ACMMSG_MSGBUFSTATUS_DSCR_ERR_Pos)          /*!< 0x00000002 */
#define ETH_ACMMSG_MSGBUFSTATUS_DSCR_ERR         ETH_ACMMSG_MSGBUFSTATUS_DSCR_ERR_Msk                    /*!< Descriptor error */
#define ETH_ACMMSG_MSGBUFSTATUS_OVERWRITTEN_Pos  (2U)
#define ETH_ACMMSG_MSGBUFSTATUS_OVERWRITTEN_Msk  (0x1UL << ETH_ACMMSG_MSGBUFSTATUS_OVERWRITTEN_Pos)       /*!< 0x00000004 */
#define ETH_ACMMSG_MSGBUFSTATUS_OVERWRITTEN      ETH_ACMMSG_MSGBUFSTATUS_OVERWRITTEN_Msk                 /*!< Overwritten buffer */
#define ETH_ACMMSG_MSGBUFSTATUS_D_LOCKED_Pos     (20U)
#define ETH_ACMMSG_MSGBUFSTATUS_D_LOCKED_Msk     (0x1UL << ETH_ACMMSG_MSGBUFSTATUS_D_LOCKED_Pos)          /*!< 0x00100000 */
#define ETH_ACMMSG_MSGBUFSTATUS_D_LOCKED         ETH_ACMMSG_MSGBUFSTATUS_D_LOCKED_Msk                    /*!< Dual locked */
#define ETH_ACMMSG_MSGBUFSTATUS_FRESH_Pos        (24U)
#define ETH_ACMMSG_MSGBUFSTATUS_FRESH_Msk        (0x1UL << ETH_ACMMSG_MSGBUFSTATUS_FRESH_Pos)             /*!< 0x01000000 */
#define ETH_ACMMSG_MSGBUFSTATUS_FRESH            ETH_ACMMSG_MSGBUFSTATUS_FRESH_Msk                       /*!< Fresh */
#define ETH_ACMMSG_MSGBUFSTATUS_EMPTY_Pos        (28U)
#define ETH_ACMMSG_MSGBUFSTATUS_EMPTY_Msk        (0x1UL << ETH_ACMMSG_MSGBUFSTATUS_EMPTY_Pos)             /*!< 0x10000000 */
#define ETH_ACMMSG_MSGBUFSTATUS_EMPTY            ETH_ACMMSG_MSGBUFSTATUS_EMPTY_Msk                       /*!< Empty */

/******************************************************************************/
/*                                                                            */
/*                    External Interrupt/Event Controller                     */
/*                               EXTI1/EXTI2                                  */
/*                   c7amba_exti_v3-0_UserSpec_v3_0_0m.pdf                    */
/*                   register declared following documentation order          */
/******************************************************************************/

/******************  Bit definition for EXTI1_RTSR1 register  *******************/
#define EXTI1_RTSR1_RT0_Pos         (0U)
#define EXTI1_RTSR1_RT0_Msk         (0x1UL << EXTI1_RTSR1_RT0_Pos)                /*!< 0x00000001 */
#define EXTI1_RTSR1_RT0             EXTI1_RTSR1_RT0_Msk                          /*!< Rising trigger event configuration bit of line 0 */
#define EXTI1_RTSR1_RT1_Pos         (1U)
#define EXTI1_RTSR1_RT1_Msk         (0x1UL << EXTI1_RTSR1_RT1_Pos)                /*!< 0x00000002 */
#define EXTI1_RTSR1_RT1             EXTI1_RTSR1_RT1_Msk                          /*!< Rising trigger event configuration bit of line 1 */
#define EXTI1_RTSR1_RT2_Pos         (2U)
#define EXTI1_RTSR1_RT2_Msk         (0x1UL << EXTI1_RTSR1_RT2_Pos)                /*!< 0x00000004 */
#define EXTI1_RTSR1_RT2             EXTI1_RTSR1_RT2_Msk                          /*!< Rising trigger event configuration bit of line 2 */
#define EXTI1_RTSR1_RT3_Pos         (3U)
#define EXTI1_RTSR1_RT3_Msk         (0x1UL << EXTI1_RTSR1_RT3_Pos)                /*!< 0x00000008 */
#define EXTI1_RTSR1_RT3             EXTI1_RTSR1_RT3_Msk                          /*!< Rising trigger event configuration bit of line 3 */
#define EXTI1_RTSR1_RT4_Pos         (4U)
#define EXTI1_RTSR1_RT4_Msk         (0x1UL << EXTI1_RTSR1_RT4_Pos)                /*!< 0x00000010 */
#define EXTI1_RTSR1_RT4             EXTI1_RTSR1_RT4_Msk                          /*!< Rising trigger event configuration bit of line 4 */
#define EXTI1_RTSR1_RT5_Pos         (5U)
#define EXTI1_RTSR1_RT5_Msk         (0x1UL << EXTI1_RTSR1_RT5_Pos)                /*!< 0x00000020 */
#define EXTI1_RTSR1_RT5             EXTI1_RTSR1_RT5_Msk                          /*!< Rising trigger event configuration bit of line 5 */
#define EXTI1_RTSR1_RT6_Pos         (6U)
#define EXTI1_RTSR1_RT6_Msk         (0x1UL << EXTI1_RTSR1_RT6_Pos)                /*!< 0x00000040 */
#define EXTI1_RTSR1_RT6             EXTI1_RTSR1_RT6_Msk                          /*!< Rising trigger event configuration bit of line 6 */
#define EXTI1_RTSR1_RT7_Pos         (7U)
#define EXTI1_RTSR1_RT7_Msk         (0x1UL << EXTI1_RTSR1_RT7_Pos)                /*!< 0x00000080 */
#define EXTI1_RTSR1_RT7             EXTI1_RTSR1_RT7_Msk                          /*!< Rising trigger event configuration bit of line 7 */
#define EXTI1_RTSR1_RT8_Pos         (8U)
#define EXTI1_RTSR1_RT8_Msk         (0x1UL << EXTI1_RTSR1_RT8_Pos)                /*!< 0x00000100 */
#define EXTI1_RTSR1_RT8             EXTI1_RTSR1_RT8_Msk                          /*!< Rising trigger event configuration bit of line 8 */
#define EXTI1_RTSR1_RT9_Pos         (9U)
#define EXTI1_RTSR1_RT9_Msk         (0x1UL << EXTI1_RTSR1_RT9_Pos)                /*!< 0x00000200 */
#define EXTI1_RTSR1_RT9             EXTI1_RTSR1_RT9_Msk                          /*!< Rising trigger event configuration bit of line 9 */
#define EXTI1_RTSR1_RT10_Pos        (10U)
#define EXTI1_RTSR1_RT10_Msk        (0x1UL << EXTI1_RTSR1_RT10_Pos)               /*!< 0x00000400 */
#define EXTI1_RTSR1_RT10            EXTI1_RTSR1_RT10_Msk                         /*!< Rising trigger event configuration bit of line 10 */
#define EXTI1_RTSR1_RT11_Pos        (11U)
#define EXTI1_RTSR1_RT11_Msk        (0x1UL << EXTI1_RTSR1_RT11_Pos)               /*!< 0x00000800 */
#define EXTI1_RTSR1_RT11            EXTI1_RTSR1_RT11_Msk                         /*!< Rising trigger event configuration bit of line 11 */
#define EXTI1_RTSR1_RT12_Pos        (12U)
#define EXTI1_RTSR1_RT12_Msk        (0x1UL << EXTI1_RTSR1_RT12_Pos)               /*!< 0x00001000 */
#define EXTI1_RTSR1_RT12            EXTI1_RTSR1_RT12_Msk                         /*!< Rising trigger event configuration bit of line 12 */
#define EXTI1_RTSR1_RT13_Pos        (13U)
#define EXTI1_RTSR1_RT13_Msk        (0x1UL << EXTI1_RTSR1_RT13_Pos)               /*!< 0x00002000 */
#define EXTI1_RTSR1_RT13            EXTI1_RTSR1_RT13_Msk                         /*!< Rising trigger event configuration bit of line 13 */
#define EXTI1_RTSR1_RT14_Pos        (14U)
#define EXTI1_RTSR1_RT14_Msk        (0x1UL << EXTI1_RTSR1_RT14_Pos)               /*!< 0x00004000 */
#define EXTI1_RTSR1_RT14            EXTI1_RTSR1_RT14_Msk                         /*!< Rising trigger event configuration bit of line 14 */
#define EXTI1_RTSR1_RT15_Pos        (15U)
#define EXTI1_RTSR1_RT15_Msk        (0x1UL << EXTI1_RTSR1_RT15_Pos)               /*!< 0x00008000 */
#define EXTI1_RTSR1_RT15            EXTI1_RTSR1_RT15_Msk                         /*!< Rising trigger event configuration bit of line 15 */
#define EXTI1_RTSR1_RT16_Pos        (16U)
#define EXTI1_RTSR1_RT16_Msk        (0x1UL << EXTI1_RTSR1_RT16_Pos)               /*!< 0x00010000 */
#define EXTI1_RTSR1_RT16            EXTI1_RTSR1_RT16_Msk                         /*!< Rising trigger event configuration bit of line 16 */
#define EXTI1_RTSR1_RT17_Pos        (17U)
#define EXTI1_RTSR1_RT17_Msk        (0x1UL << EXTI1_RTSR1_RT17_Pos)               /*!< 0x00020000 */
#define EXTI1_RTSR1_RT17            EXTI1_RTSR1_RT17_Msk                         /*!< Rising trigger event configuration bit of line 17 */
#define EXTI1_RTSR1_RT18_Pos        (18U)
#define EXTI1_RTSR1_RT18_Msk        (0x1UL << EXTI1_RTSR1_RT18_Pos)               /*!< 0x00040000 */
#define EXTI1_RTSR1_RT18            EXTI1_RTSR1_RT18_Msk                         /*!< Rising trigger event configuration bit of line 18 */

/******************  Bit definition for EXTI1_FTSR1 register  *******************/
#define EXTI1_FTSR1_FT0_Pos         (0U)
#define EXTI1_FTSR1_FT0_Msk         (0x1UL << EXTI1_FTSR1_FT0_Pos)                /*!< 0x00000001 */
#define EXTI1_FTSR1_FT0             EXTI1_FTSR1_FT0_Msk                          /*!< Falling trigger event configuration bit of line 0 */
#define EXTI1_FTSR1_FT1_Pos         (1U)
#define EXTI1_FTSR1_FT1_Msk         (0x1UL << EXTI1_FTSR1_FT1_Pos)                /*!< 0x00000002 */
#define EXTI1_FTSR1_FT1             EXTI1_FTSR1_FT1_Msk                          /*!< Falling trigger event configuration bit of line 1 */
#define EXTI1_FTSR1_FT2_Pos         (2U)
#define EXTI1_FTSR1_FT2_Msk         (0x1UL << EXTI1_FTSR1_FT2_Pos)                /*!< 0x00000004 */
#define EXTI1_FTSR1_FT2             EXTI1_FTSR1_FT2_Msk                          /*!< Falling trigger event configuration bit of line 2 */
#define EXTI1_FTSR1_FT3_Pos         (3U)
#define EXTI1_FTSR1_FT3_Msk         (0x1UL << EXTI1_FTSR1_FT3_Pos)                /*!< 0x00000008 */
#define EXTI1_FTSR1_FT3             EXTI1_FTSR1_FT3_Msk                          /*!< Falling trigger event configuration bit of line 3 */
#define EXTI1_FTSR1_FT4_Pos         (4U)
#define EXTI1_FTSR1_FT4_Msk         (0x1UL << EXTI1_FTSR1_FT4_Pos)                /*!< 0x00000010 */
#define EXTI1_FTSR1_FT4             EXTI1_FTSR1_FT4_Msk                          /*!< Falling trigger event configuration bit of line 4 */
#define EXTI1_FTSR1_FT5_Pos         (5U)
#define EXTI1_FTSR1_FT5_Msk         (0x1UL << EXTI1_FTSR1_FT5_Pos)                /*!< 0x00000020 */
#define EXTI1_FTSR1_FT5             EXTI1_FTSR1_FT5_Msk                          /*!< Falling trigger event configuration bit of line 5 */
#define EXTI1_FTSR1_FT6_Pos         (6U)
#define EXTI1_FTSR1_FT6_Msk         (0x1UL << EXTI1_FTSR1_FT6_Pos)                /*!< 0x00000040 */
#define EXTI1_FTSR1_FT6             EXTI1_FTSR1_FT6_Msk                          /*!< Falling trigger event configuration bit of line 6 */
#define EXTI1_FTSR1_FT7_Pos         (7U)
#define EXTI1_FTSR1_FT7_Msk         (0x1UL << EXTI1_FTSR1_FT7_Pos)                /*!< 0x00000080 */
#define EXTI1_FTSR1_FT7             EXTI1_FTSR1_FT7_Msk                          /*!< Falling trigger event configuration bit of line 7 */
#define EXTI1_FTSR1_FT8_Pos         (8U)
#define EXTI1_FTSR1_FT8_Msk         (0x1UL << EXTI1_FTSR1_FT8_Pos)                /*!< 0x00000100 */
#define EXTI1_FTSR1_FT8             EXTI1_FTSR1_FT8_Msk                          /*!< Falling trigger event configuration bit of line 8 */
#define EXTI1_FTSR1_FT9_Pos         (9U)
#define EXTI1_FTSR1_FT9_Msk         (0x1UL << EXTI1_FTSR1_FT9_Pos)                /*!< 0x00000200 */
#define EXTI1_FTSR1_FT9             EXTI1_FTSR1_FT9_Msk                          /*!< Falling trigger event configuration bit of line 9 */
#define EXTI1_FTSR1_FT10_Pos        (10U)
#define EXTI1_FTSR1_FT10_Msk        (0x1UL << EXTI1_FTSR1_FT10_Pos)               /*!< 0x00000400 */
#define EXTI1_FTSR1_FT10            EXTI1_FTSR1_FT10_Msk                         /*!< Falling trigger event configuration bit of line 10 */
#define EXTI1_FTSR1_FT11_Pos        (11U)
#define EXTI1_FTSR1_FT11_Msk        (0x1UL << EXTI1_FTSR1_FT11_Pos)               /*!< 0x00000800 */
#define EXTI1_FTSR1_FT11            EXTI1_FTSR1_FT11_Msk                         /*!< Falling trigger event configuration bit of line 11 */
#define EXTI1_FTSR1_FT12_Pos        (12U)
#define EXTI1_FTSR1_FT12_Msk        (0x1UL << EXTI1_FTSR1_FT12_Pos)               /*!< 0x00001000 */
#define EXTI1_FTSR1_FT12            EXTI1_FTSR1_FT12_Msk                         /*!< Falling trigger event configuration bit of line 12 */
#define EXTI1_FTSR1_FT13_Pos        (13U)
#define EXTI1_FTSR1_FT13_Msk        (0x1UL << EXTI1_FTSR1_FT13_Pos)               /*!< 0x00002000 */
#define EXTI1_FTSR1_FT13            EXTI1_FTSR1_FT13_Msk                         /*!< Falling trigger event configuration bit of line 13 */
#define EXTI1_FTSR1_FT14_Pos        (14U)
#define EXTI1_FTSR1_FT14_Msk        (0x1UL << EXTI1_FTSR1_FT14_Pos)               /*!< 0x00004000 */
#define EXTI1_FTSR1_FT14            EXTI1_FTSR1_FT14_Msk                         /*!< Falling trigger event configuration bit of line 14 */
#define EXTI1_FTSR1_FT15_Pos        (15U)
#define EXTI1_FTSR1_FT15_Msk        (0x1UL << EXTI1_FTSR1_FT15_Pos)               /*!< 0x00008000 */
#define EXTI1_FTSR1_FT15            EXTI1_FTSR1_FT15_Msk                         /*!< Falling trigger event configuration bit of line 15 */
#define EXTI1_FTSR1_FT16_Pos        (16U)
#define EXTI1_FTSR1_FT16_Msk        (0x1UL << EXTI1_FTSR1_FT16_Pos)               /*!< 0x00010000 */
#define EXTI1_FTSR1_FT16            EXTI1_FTSR1_FT16_Msk                         /*!< Falling trigger event configuration bit of line 16 */
#define EXTI1_FTSR1_FT17_Pos        (17U)
#define EXTI1_FTSR1_FT17_Msk        (0x1UL << EXTI1_FTSR1_FT17_Pos)               /*!< 0x00020000 */
#define EXTI1_FTSR1_FT17            EXTI1_FTSR1_FT17_Msk                         /*!< Falling trigger event configuration bit of line 17 */
#define EXTI1_FTSR1_FT18_Pos        (18U)
#define EXTI1_FTSR1_FT18_Msk        (0x1UL << EXTI1_FTSR1_FT18_Pos)               /*!< 0x00040000 */
#define EXTI1_FTSR1_FT18            EXTI1_FTSR1_FT18_Msk                         /*!< Falling trigger event configuration bit of line 18 */

