zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp211axx_cm33.h
/*******************  Bit definition for EXTI2_CmIMR3 register  *******************/
#define EXTI2_IMR3_IM64_Pos         (0U)
#define EXTI2_IMR3_IM64_Msk         (0x1UL << EXTI2_IMR3_IM64_Pos)                /*!< 0x00000001 */
#define EXTI2_IMR3_IM64             EXTI2_IMR3_IM64_Msk                          /*!< Interrupt Mask on line 64 */
#define EXTI2_IMR3_IM65_Pos         (1U)
#define EXTI2_IMR3_IM65_Msk         (0x1UL << EXTI2_IMR3_IM65_Pos)                /*!< 0x00000002 */
#define EXTI2_IMR3_IM65             EXTI2_IMR3_IM65_Msk                          /*!< Interrupt Mask on line 65 */
#define EXTI2_IMR3_IM66_Pos         (2U)
#define EXTI2_IMR3_IM66_Msk         (0x1UL << EXTI2_IMR3_IM66_Pos)                /*!< 0x00000004 */
#define EXTI2_IMR3_IM66             EXTI2_IMR3_IM66_Msk                          /*!< Interrupt Mask on line 66 */
#define EXTI2_IMR3_IM67_Pos         (3U)
#define EXTI2_IMR3_IM67_Msk         (0x1UL << EXTI2_IMR3_IM67_Pos)                /*!< 0x00000008 */
#define EXTI2_IMR3_IM67             EXTI2_IMR3_IM67_Msk                          /*!< Interrupt Mask on line 67 */
#define EXTI2_IMR3_IM68_Pos         (4U)
#define EXTI2_IMR3_IM68_Msk         (0x1UL << EXTI2_IMR3_IM68_Pos)                /*!< 0x00000010 */
#define EXTI2_IMR3_IM68             EXTI2_IMR3_IM68_Msk                          /*!< Interrupt Mask on line 68 */
#define EXTI2_IMR3_IM69_Pos         (5U)
#define EXTI2_IMR3_IM69_Msk         (0x1UL << EXTI2_IMR3_IM69_Pos)                /*!< 0x00000020 */
#define EXTI2_IMR3_IM69             EXTI2_IMR3_IM69_Msk                          /*!< Interrupt Mask on line 69 */
#define EXTI2_IMR3_IM70_Pos         (6U)
#define EXTI2_IMR3_IM70_Msk         (0x1UL << EXTI2_IMR3_IM70_Pos)                /*!< 0x00000040 */
#define EXTI2_IMR3_IM70             EXTI2_IMR3_IM70_Msk                          /*!< Interrupt Mask on line 70 */
/* No interrupt line 71 */
/* No interrupt line 72 */
/* No interrupt line 73 */
/* No interrupt line 74 */
/* No interrupt line 75 */
#define EXTI2_IMR3_IM76_Pos         (12U)
#define EXTI2_IMR3_IM76_Msk         (0x1UL << EXTI2_IMR3_IM76_Pos)                /*!< 0x00001000 */
#define EXTI2_IMR3_IM76             EXTI2_IMR3_IM76_Msk                          /*!< Interrupt Mask on line 76 */





/******************************************************************************/
/*                                                                            */
/*                       Flexible Memory Controller                           */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for FMC_BCRx registers (x=1..4)  *********/
#define FMC_BCRx_MBKEN_Pos            (0U)
#define FMC_BCRx_MBKEN_Msk            (0x1UL << FMC_BCRx_MBKEN_Pos)           /*!< 0x00000001 */
#define FMC_BCRx_MBKEN                FMC_BCRx_MBKEN_Msk                     /*!< Memory bank enable bit. */
#define FMC_BCRx_MUXEN_Pos            (1U)
#define FMC_BCRx_MUXEN_Msk            (0x1UL << FMC_BCRx_MUXEN_Pos)           /*!< 0x00000002 */
#define FMC_BCRx_MUXEN                FMC_BCRx_MUXEN_Msk                     /*!< Address/data multiplexing enable bit. */
#define FMC_BCRx_MTYP_Pos             (2U)
#define FMC_BCRx_MTYP_Msk             (0x3UL << FMC_BCRx_MTYP_Pos)            /*!< 0x0000000C */
#define FMC_BCRx_MTYP                 FMC_BCRx_MTYP_Msk                      /*!< Memory type. */
#define FMC_BCRx_MWID_Pos             (4U)
#define FMC_BCRx_MWID_Msk             (0x3UL << FMC_BCRx_MWID_Pos)            /*!< 0x00000030 */
#define FMC_BCRx_MWID                 FMC_BCRx_MWID_Msk                      /*!< Memory data bus width. */
#define FMC_BCRx_FACCEN_Pos           (6U)
#define FMC_BCRx_FACCEN_Msk           (0x1UL << FMC_BCRx_FACCEN_Pos)          /*!< 0x00000040 */
#define FMC_BCRx_FACCEN               FMC_BCRx_FACCEN_Msk                    /*!< Flash memory access enable */
#define FMC_BCRx_BURSTEN_Pos          (8U)
#define FMC_BCRx_BURSTEN_Msk          (0x1UL << FMC_BCRx_BURSTEN_Pos)         /*!< 0x00000100 */
#define FMC_BCRx_BURSTEN              FMC_BCRx_BURSTEN_Msk                   /*!< Burst enable bit. */
#define FMC_BCRx_WAITPOL_Pos          (9U)
#define FMC_BCRx_WAITPOL_Msk          (0x1UL << FMC_BCRx_WAITPOL_Pos)         /*!< 0x00000200 */
#define FMC_BCRx_WAITPOL              FMC_BCRx_WAITPOL_Msk                   /*!< Wait signal polarity bit. */
#define FMC_BCRx_WAITCFG_Pos          (11U)
#define FMC_BCRx_WAITCFG_Msk          (0x1UL << FMC_BCRx_WAITCFG_Pos)         /*!< 0x00000800 */
#define FMC_BCRx_WAITCFG              FMC_BCRx_WAITCFG_Msk                   /*!< Wait timing configuration. */
#define FMC_BCRx_WREN_Pos             (12U)
#define FMC_BCRx_WREN_Msk             (0x1UL << FMC_BCRx_WREN_Pos)            /*!< 0x00001000 */
#define FMC_BCRx_WREN                 FMC_BCRx_WREN_Msk                      /*!< Write enable bit. */
#define FMC_BCRx_WAITEN_Pos           (13U)
#define FMC_BCRx_WAITEN_Msk           (0x1UL << FMC_BCRx_WAITEN_Pos)          /*!< 0x00002000 */
#define FMC_BCRx_WAITEN               FMC_BCRx_WAITEN_Msk                    /*!< Wait enable bit. */
#define FMC_BCRx_EXTMOD_Pos           (14U)
#define FMC_BCRx_EXTMOD_Msk           (0x1UL << FMC_BCRx_EXTMOD_Pos)          /*!< 0x00004000 */
#define FMC_BCRx_EXTMOD               FMC_BCRx_EXTMOD_Msk                    /*!< Extended mode enable. */
#define FMC_BCRx_ASYNCWAIT_Pos        (15U)
#define FMC_BCRx_ASYNCWAIT_Msk        (0x1UL << FMC_BCRx_ASYNCWAIT_Pos)       /*!< 0x00008000 */
#define FMC_BCRx_ASYNCWAIT            FMC_BCRx_ASYNCWAIT_Msk                 /*!< Wait signal during asynchronous transfers */
#define FMC_BCRx_CPSIZE_Pos           (16U)
#define FMC_BCRx_CPSIZE_Msk           (0x7UL << FMC_BCRx_CPSIZE_Pos)          /*!< 0x00070000 */
#define FMC_BCRx_CPSIZE               FMC_BCRx_CPSIZE_Msk                    /*!< CRAM Page size. */
#define FMC_BCRx_CPSIZE_0             (0x1UL << FMC_BCRx_CPSIZE_Pos)          /*!< 0x00010000 */
#define FMC_BCRx_CPSIZE_1             (0x2UL << FMC_BCRx_CPSIZE_Pos)          /*!< 0x00020000 */
#define FMC_BCRx_CPSIZE_2             (0x4UL << FMC_BCRx_CPSIZE_Pos)          /*!< 0x00040000 */
#define FMC_BCRx_CBURSTRW_Pos         (19U)
#define FMC_BCRx_CBURSTRW_Msk         (0x1UL << FMC_BCRx_CBURSTRW_Pos)        /*!< 0x00080000 */
#define FMC_BCRx_CBURSTRW             FMC_BCRx_CBURSTRW_Msk                  /*!< Write burst enable. */
#define FMC_BCRx_CSCOUNT0_Pos         (20U)
#define FMC_BCRx_CSCOUNT0_Msk         (0x1UL << FMC_BCRx_CSCOUNT0_Pos)        /*!< 0x00100000 */
#define FMC_BCRx_CSCOUNT0             FMC_BCRx_CSCOUNT0_Msk                  /*!< Chip Select (CS) counter */
#define FMC_BCRx_CSCOUNT1_Pos         (21U)
#define FMC_BCRx_CSCOUNT1_Msk         (0x1UL << FMC_BCRx_CSCOUNT1_Pos)        /*!< 0x00200000 */
#define FMC_BCRx_CSCOUNT1             FMC_BCRx_CSCOUNT1_Msk                  /*!< Chip Select (CS) counter */
#define FMC_BCRx_NBLSET_Pos           (22U)
#define FMC_BCRx_NBLSET_Msk           (0x3UL << FMC_BCRx_NBLSET_Pos)          /*!< 0x00C00000 */
#define FMC_BCRx_NBLSET               FMC_BCRx_NBLSET_Msk                    /*!< Byte lane (NBL) SETUP */

/******************  Bit definition for FMC_BTRx registers (x=1..4)  *********/
#define FMC_BTRx_ADDSET_Pos           (0U)
#define FMC_BTRx_ADDSET_Msk           (0xFUL << FMC_BTRx_ADDSET_Pos)          /*!< 0x0000000F */
#define FMC_BTRx_ADDSET               FMC_BTRx_ADDSET_Msk                    /*!< Address setup phase duration */
#define FMC_BTRx_ADDHLD_Pos           (4U)
#define FMC_BTRx_ADDHLD_Msk           (0xFUL << FMC_BTRx_ADDHLD_Pos)          /*!< 0x000000F0 */
#define FMC_BTRx_ADDHLD               FMC_BTRx_ADDHLD_Msk                    /*!< Address-hold phase duration */
#define FMC_BTRx_DATAST_Pos           (8U)
#define FMC_BTRx_DATAST_Msk           (0xFFUL << FMC_BTRx_DATAST_Pos)         /*!< 0x0000FF00 */
#define FMC_BTRx_DATAST               FMC_BTRx_DATAST_Msk                    /*!< Data-phase duration */
#define FMC_BTRx_BUSTURN_Pos          (16U)
#define FMC_BTRx_BUSTURN_Msk          (0xFUL << FMC_BTRx_BUSTURN_Pos)         /*!< 0x000F0000 */
#define FMC_BTRx_BUSTURN              FMC_BTRx_BUSTURN_Msk                   /*!< Bus turnaround phase duration */
#define FMC_BTRx_CLKDIV_Pos           (20U)
#define FMC_BTRx_CLKDIV_Msk           (0xFUL << FMC_BTRx_CLKDIV_Pos)          /*!< 0x00F00000 */
#define FMC_BTRx_CLKDIV               FMC_BTRx_CLKDIV_Msk                    /*!< Clock divide ratio (for FMC_CLK signal) */
#define FMC_BTRx_DATLAT_Pos           (24U)
#define FMC_BTRx_DATLAT_Msk           (0xFUL << FMC_BTRx_DATLAT_Pos)          /*!< 0x0F000000 */
#define FMC_BTRx_DATLAT               FMC_BTRx_DATLAT_Msk                    /*!< Data latency for synchronous memory (see note below bit descriptions) */
#define FMC_BTRx_ACCMOD_Pos           (28U)
#define FMC_BTRx_ACCMOD_Msk           (0x3UL << FMC_BTRx_ACCMOD_Pos)          /*!< 0x30000000 */
#define FMC_BTRx_ACCMOD               FMC_BTRx_ACCMOD_Msk                    /*!< Access mode */
#define FMC_BTRx_DATAHLD_Pos          (30U)
#define FMC_BTRx_DATAHLD_Msk          (0x3UL << FMC_BTRx_DATAHLD_Pos)         /*!< 0xC0000000 */
#define FMC_BTRx_DATAHLD              FMC_BTRx_DATAHLD_Msk                   /*!< Data Hold phase duration */

/*****************  Bit definition for FMC_CFGR register  *****************/
#define FMC_CFGR_CLKDIV_Pos           (16U)
#define FMC_CFGR_CLKDIV_Msk           (0xFUL << FMC_CFGR_CLKDIV_Pos)          /*!< 0x000F0000 */
#define FMC_CFGR_CLKDIV               FMC_CFGR_CLKDIV_Msk                    /*!< Clock divide ratio (for FMC_CLK signal) */
#define FMC_CFGR_CCLKEN_Pos           (20U)
#define FMC_CFGR_CCLKEN_Msk           (0x1UL << FMC_CFGR_CCLKEN_Pos)          /*!< 0x00100000 */
#define FMC_CFGR_CCLKEN               FMC_CFGR_CCLKEN_Msk                    /*!< Continuous clock enable */
#define FMC_CFGR_FMCEN_Pos            (31U)
#define FMC_CFGR_FMCEN_Msk            (0x1UL << FMC_CFGR_FMCEN_Pos)           /*!< 0x80000000 */
#define FMC_CFGR_FMCEN                FMC_CFGR_FMCEN_Msk                     /*!< FMC controller enable */

/*****************  Bit definition for FMC_PCR register  ******************/
#define FMC_PCR_PWAITEN_Pos           (1U)
#define FMC_PCR_PWAITEN_Msk           (0x1UL << FMC_PCR_PWAITEN_Pos)          /*!< 0x00000002 */
#define FMC_PCR_PWAITEN               FMC_PCR_PWAITEN_Msk                    /*!< Wait feature enable bit */
#define FMC_PCR_PBKEN_Pos             (2U)
#define FMC_PCR_PBKEN_Msk             (0x1UL << FMC_PCR_PBKEN_Pos)            /*!< 0x00000004 */
#define FMC_PCR_PBKEN                 FMC_PCR_PBKEN_Msk                      /*!< NAND Flash memory bank enable bit */
#define FMC_PCR_PWID_Pos              (4U)
#define FMC_PCR_PWID_Msk              (0x3UL << FMC_PCR_PWID_Pos)             /*!< 0x00000030 */
#define FMC_PCR_PWID                  FMC_PCR_PWID_Msk                       /*!< Data bus width */
#define FMC_PCR_ECCEN_Pos             (6U)
#define FMC_PCR_ECCEN_Msk             (0x1UL << FMC_PCR_ECCEN_Pos)            /*!< 0x00000040 */
#define FMC_PCR_ECCEN                 FMC_PCR_ECCEN_Msk                      /*!< ECC computation logic enable bit */
#define FMC_PCR_ECCALG_Pos            (8U)
#define FMC_PCR_ECCALG_Msk            (0x1UL << FMC_PCR_ECCALG_Pos)           /*!< 0x00000100 */
#define FMC_PCR_ECCALG                FMC_PCR_ECCALG_Msk                     /*!< ECC algorithm */
#define FMC_PCR_TCLR_Pos              (9U)
#define FMC_PCR_TCLR_Msk              (0xFUL << FMC_PCR_TCLR_Pos)             /*!< 0x00001E00 */
#define FMC_PCR_TCLR                  FMC_PCR_TCLR_Msk                       /*!< CLE to RE delay. */
#define FMC_PCR_TAR_Pos               (13U)
#define FMC_PCR_TAR_Msk               (0xFUL << FMC_PCR_TAR_Pos)              /*!< 0x0001E000 */
#define FMC_PCR_TAR                   FMC_PCR_TAR_Msk                        /*!< ALE to RE delay. */
#define FMC_PCR_ECCSS_Pos             (17U)
#define FMC_PCR_ECCSS_Msk             (0x7UL << FMC_PCR_ECCSS_Pos)            /*!< 0x000E0000 */
#define FMC_PCR_ECCSS                 FMC_PCR_ECCSS_Msk                      /*!< ECC sector size (used to access spare area) */
#define FMC_PCR_TCEH_Pos              (20U)
#define FMC_PCR_TCEH_Msk              (0xFUL << FMC_PCR_TCEH_Pos)             /*!< 0x00F00000 */
#define FMC_PCR_TCEH                  FMC_PCR_TCEH_Msk                       /*!< Chip select high timing */
#define FMC_PCR_BCHECC_Pos            (24U)
#define FMC_PCR_BCHECC_Msk            (0x1UL << FMC_PCR_BCHECC_Pos)           /*!< 0x01000000 */
#define FMC_PCR_BCHECC                FMC_PCR_BCHECC_Msk                     /*!< BCH error correction capability */
#define FMC_PCR_WEN_Pos               (25U)
#define FMC_PCR_WEN_Msk               (0x1UL << FMC_PCR_WEN_Pos)              /*!< 0x02000000 */
#define FMC_PCR_WEN                   FMC_PCR_WEN_Msk                        /*!< Write enable */

/******************  Bit definition for FMC_SR register  ******************/
#define FMC_SR_ISOST_Pos              (0U)
#define FMC_SR_ISOST_Msk              (0x3UL << FMC_SR_ISOST_Pos)             /*!< 0x00000003 */
#define FMC_SR_ISOST                  FMC_SR_ISOST_Msk                       /*!< FMC isolation state with respect to the AXI interface */
#define FMC_SR_PEF_Pos                (4U)
#define FMC_SR_PEF_Msk                (0x1UL << FMC_SR_PEF_Pos)               /*!< 0x00000010 */
#define FMC_SR_PEF                    FMC_SR_PEF_Msk                         /*!< Pipe Empty Flag */
#define FMC_SR_NWRF_Pos               (6U)
#define FMC_SR_NWRF_Msk               (0x1UL << FMC_SR_NWRF_Pos)              /*!< 0x00000040 */
#define FMC_SR_NWRF                   FMC_SR_NWRF_Msk                        /*!< NAND write request flag */

/*****************  Bit definition for FMC_PMEM register  *****************/
#define FMC_PMEM_MEMSET_Pos           (0U)
#define FMC_PMEM_MEMSET_Msk           (0xFFUL << FMC_PMEM_MEMSET_Pos)         /*!< 0x000000FF */
#define FMC_PMEM_MEMSET               FMC_PMEM_MEMSET_Msk                    /*!< Common memory setup time */
#define FMC_PMEM_MEMWAIT_Pos          (8U)
#define FMC_PMEM_MEMWAIT_Msk          (0xFFUL << FMC_PMEM_MEMWAIT_Pos)        /*!< 0x0000FF00 */
#define FMC_PMEM_MEMWAIT              FMC_PMEM_MEMWAIT_Msk                   /*!< Common memory wait time */
#define FMC_PMEM_MEMHOLD_Pos          (16U)
#define FMC_PMEM_MEMHOLD_Msk          (0xFFUL << FMC_PMEM_MEMHOLD_Pos)        /*!< 0x00FF0000 */
#define FMC_PMEM_MEMHOLD              FMC_PMEM_MEMHOLD_Msk                   /*!< Common memory hold time */
#define FMC_PMEM_MEMHIZ_Pos           (24U)
#define FMC_PMEM_MEMHIZ_Msk           (0xFFUL << FMC_PMEM_MEMHIZ_Pos)         /*!< 0xFF000000 */
#define FMC_PMEM_MEMHIZ               FMC_PMEM_MEMHIZ_Msk                    /*!< Common memory data bus Hi-Z time */

/*****************  Bit definition for FMC_PATT register  *****************/
#define FMC_PATT_ATTSET_Pos           (0U)
#define FMC_PATT_ATTSET_Msk           (0xFFUL << FMC_PATT_ATTSET_Pos)         /*!< 0x000000FF */
#define FMC_PATT_ATTSET               FMC_PATT_ATTSET_Msk                    /*!< Attribute memory setup time */
#define FMC_PATT_ATTWAIT_Pos          (8U)
#define FMC_PATT_ATTWAIT_Msk          (0xFFUL << FMC_PATT_ATTWAIT_Pos)        /*!< 0x0000FF00 */
#define FMC_PATT_ATTWAIT              FMC_PATT_ATTWAIT_Msk                   /*!< Attribute memory wait time */
#define FMC_PATT_ATTHOLD_Pos          (16U)
#define FMC_PATT_ATTHOLD_Msk          (0xFFUL << FMC_PATT_ATTHOLD_Pos)        /*!< 0x00FF0000 */
#define FMC_PATT_ATTHOLD              FMC_PATT_ATTHOLD_Msk                   /*!< Attribute memory hold time */
#define FMC_PATT_ATTHIZ_Pos           (24U)
#define FMC_PATT_ATTHIZ_Msk           (0xFFUL << FMC_PATT_ATTHIZ_Pos)         /*!< 0xFF000000 */
#define FMC_PATT_ATTHIZ               FMC_PATT_ATTHIZ_Msk                    /*!< Attribute memory data bus Hi-Z time */

/*****************  Bit definition for FMC_HPR register  ******************/
#define FMC_HPR_HPR_Pos               (0U)
#define FMC_HPR_HPR_Msk               (0xFFFFFFFFUL << FMC_HPR_HPR_Pos)       /*!< 0xFFFFFFFF */
#define FMC_HPR_HPR                   FMC_HPR_HPR_Msk                        /*!< Hamming parity result */

