zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp211axx_cm33.h
/**************  Bit fields for RCC_IWDGC2CFGSETR register  ***************/
#define RCC_IWDGC2CFGSETR_IWDG3_SYSRSTEN_Pos       (0U)
#define RCC_IWDGC2CFGSETR_IWDG3_SYSRSTEN_Msk       (0x1UL << RCC_IWDGC2CFGSETR_IWDG3_SYSRSTEN_Pos)      /*!< 0x00000001 */
#define RCC_IWDGC2CFGSETR_IWDG3_SYSRSTEN           RCC_IWDGC2CFGSETR_IWDG3_SYSRSTEN_Msk                /*!< Enable of IWDG3 timeout event to reset the application */
#define RCC_IWDGC2CFGSETR_IWDG4_SYSRSTEN_Pos       (2U)
#define RCC_IWDGC2CFGSETR_IWDG4_SYSRSTEN_Msk       (0x1UL << RCC_IWDGC2CFGSETR_IWDG4_SYSRSTEN_Pos)      /*!< 0x00000004 */
#define RCC_IWDGC2CFGSETR_IWDG4_SYSRSTEN           RCC_IWDGC2CFGSETR_IWDG4_SYSRSTEN_Msk                /*!< Enable of IWDG4 timeout event to reset the application */
#define RCC_IWDGC2CFGSETR_IWDG4_KERRST_Pos         (18U)
#define RCC_IWDGC2CFGSETR_IWDG4_KERRST_Msk         (0x1UL << RCC_IWDGC2CFGSETR_IWDG4_KERRST_Pos)        /*!< 0x00040000 */
#define RCC_IWDGC2CFGSETR_IWDG4_KERRST             RCC_IWDGC2CFGSETR_IWDG4_KERRST_Msk                  /*!< IWDG4 kernel reset */

/**************  Bit fields for RCC_IWDGC2CFGCLRR register  ***************/
#define RCC_IWDGC2CFGCLRR_IWDG3_SYSRSTEN_Pos       (0U)
#define RCC_IWDGC2CFGCLRR_IWDG3_SYSRSTEN_Msk       (0x1UL << RCC_IWDGC2CFGCLRR_IWDG3_SYSRSTEN_Pos)      /*!< 0x00000001 */
#define RCC_IWDGC2CFGCLRR_IWDG3_SYSRSTEN           RCC_IWDGC2CFGCLRR_IWDG3_SYSRSTEN_Msk                /*!< Clear of IWDG3 timeout event to reset the application */
#define RCC_IWDGC2CFGCLRR_IWDG4_SYSRSTEN_Pos       (2U)
#define RCC_IWDGC2CFGCLRR_IWDG4_SYSRSTEN_Msk       (0x1UL << RCC_IWDGC2CFGCLRR_IWDG4_SYSRSTEN_Pos)      /*!< 0x00000004 */
#define RCC_IWDGC2CFGCLRR_IWDG4_SYSRSTEN           RCC_IWDGC2CFGCLRR_IWDG4_SYSRSTEN_Msk                /*!< Clear of IWDG4 timeout event to reset the application */
#define RCC_IWDGC2CFGCLRR_IWDG4_KERRST_Pos         (18U)
#define RCC_IWDGC2CFGCLRR_IWDG4_KERRST_Msk         (0x1UL << RCC_IWDGC2CFGCLRR_IWDG4_KERRST_Pos)        /*!< 0x00040000 */
#define RCC_IWDGC2CFGCLRR_IWDG4_KERRST             RCC_IWDGC2CFGCLRR_IWDG4_KERRST_Msk                  /*!< IWDG4 kernel reset */

/* Bit fields for RCC_MCO1CFGR register */
#define RCC_MCO1CFGR_MCO1SEL_Pos                   (0U)
#define RCC_MCO1CFGR_MCO1SEL_Msk                   (0x1UL << RCC_MCO1CFGR_MCO1SEL_Pos)                  /*!< 0x00000001 */
#define RCC_MCO1CFGR_MCO1SEL                       RCC_MCO1CFGR_MCO1SEL_Msk                          /*!< MCO1 clock output selection */
#define RCC_MCO1CFGR_MCO1ON_Pos                    (8U)
#define RCC_MCO1CFGR_MCO1ON_Msk                    (0x1UL << RCC_MCO1CFGR_MCO1ON_Pos)                   /*!< 0x00000100 */
#define RCC_MCO1CFGR_MCO1ON                        RCC_MCO1CFGR_MCO1ON_Msk                           /*!< Control of MCO1 output */

/* Bit fields for RCC_MCO2CFGR register */
#define RCC_MCO2CFGR_MCO2SEL_Pos                   (0U)
#define RCC_MCO2CFGR_MCO2SEL_Msk                   (0x1UL << RCC_MCO2CFGR_MCO2SEL_Pos)                  /*!< 0x00000001 */
#define RCC_MCO2CFGR_MCO2SEL                       RCC_MCO2CFGR_MCO2SEL_Msk                          /*!< MCO2 clock output selection */
#define RCC_MCO2CFGR_MCO2ON_Pos                    (8U)
#define RCC_MCO2CFGR_MCO2ON_Msk                    (0x1UL << RCC_MCO2CFGR_MCO2ON_Pos)                   /*!< 0x00000100 */
#define RCC_MCO2CFGR_MCO2ON                        RCC_MCO2CFGR_MCO2ON_Msk                           /*!< Control of the MCO2 output */

/* Bit fields for RCC_OCENSETR register */
#define RCC_OCENSETR_HSION_Pos                     (0U)
#define RCC_OCENSETR_HSION_Msk                     (0x1UL << RCC_OCENSETR_HSION_Pos)                    /*!< 0x00000001 */
#define RCC_OCENSETR_HSION                         RCC_OCENSETR_HSION_Msk                            /*!< HSION bit set */
#define RCC_OCENSETR_HSIKERON_Pos                  (1U)
#define RCC_OCENSETR_HSIKERON_Msk                  (0x1UL << RCC_OCENSETR_HSIKERON_Pos)                 /*!< 0x00000002 */
#define RCC_OCENSETR_HSIKERON                      RCC_OCENSETR_HSIKERON_Msk                         /*!< HSIKERON bit set */
#define RCC_OCENSETR_MSION_Pos                     (2U)
#define RCC_OCENSETR_MSION_Msk                     (0x1UL << RCC_OCENSETR_MSION_Pos)                    /*!< 0x00000004 */
#define RCC_OCENSETR_MSION                         RCC_OCENSETR_MSION_Msk                            /*!< MSION bit set */
#define RCC_OCENSETR_MSIKERON_Pos                  (3U)
#define RCC_OCENSETR_MSIKERON_Msk                  (0x1UL << RCC_OCENSETR_MSIKERON_Pos)                 /*!< 0x00000008 */
#define RCC_OCENSETR_MSIKERON                      RCC_OCENSETR_MSIKERON_Msk                         /*!< MSIKERON bit set */
#define RCC_OCENSETR_HSEDIV2ON_Pos                 (5U)
#define RCC_OCENSETR_HSEDIV2ON_Msk                 (0x1UL << RCC_OCENSETR_HSEDIV2ON_Pos)                /*!< 0x00000020 */
#define RCC_OCENSETR_HSEDIV2ON                     RCC_OCENSETR_HSEDIV2ON_Msk                        /*!< HSEDIV2ON bit set */
#define RCC_OCENSETR_HSEDIV2BYP_Pos                (6U)
#define RCC_OCENSETR_HSEDIV2BYP_Msk                (0x1UL << RCC_OCENSETR_HSEDIV2BYP_Pos)               /*!< 0x00000040 */
#define RCC_OCENSETR_HSEDIV2BYP                    RCC_OCENSETR_HSEDIV2BYP_Msk                       /*!< HSEDIV2BYP bit set */
#define RCC_OCENSETR_HSEDIGBYP_Pos                 (7U)
#define RCC_OCENSETR_HSEDIGBYP_Msk                 (0x1UL << RCC_OCENSETR_HSEDIGBYP_Pos)                /*!< 0x00000080 */
#define RCC_OCENSETR_HSEDIGBYP                     RCC_OCENSETR_HSEDIGBYP_Msk                        /*!< HSEDIGBYP bit set */
#define RCC_OCENSETR_HSEON_Pos                     (8U)
#define RCC_OCENSETR_HSEON_Msk                     (0x1UL << RCC_OCENSETR_HSEON_Pos)                    /*!< 0x00000100 */
#define RCC_OCENSETR_HSEON                         RCC_OCENSETR_HSEON_Msk                            /*!< HSEON bit set */
#define RCC_OCENSETR_HSEKERON_Pos                  (9U)
#define RCC_OCENSETR_HSEKERON_Msk                  (0x1UL << RCC_OCENSETR_HSEKERON_Pos)                 /*!< 0x00000200 */
#define RCC_OCENSETR_HSEKERON                      RCC_OCENSETR_HSEKERON_Msk                         /*!< HSEKERON bit set */
#define RCC_OCENSETR_HSEBYP_Pos                    (10U)
#define RCC_OCENSETR_HSEBYP_Msk                    (0x1UL << RCC_OCENSETR_HSEBYP_Pos)                   /*!< 0x00000400 */
#define RCC_OCENSETR_HSEBYP                        RCC_OCENSETR_HSEBYP_Msk                           /*!< HSEBYP bit set */
#define RCC_OCENSETR_HSECSSON_Pos                  (11U)
#define RCC_OCENSETR_HSECSSON_Msk                  (0x1UL << RCC_OCENSETR_HSECSSON_Pos)                 /*!< 0x00000800 */
#define RCC_OCENSETR_HSECSSON                      RCC_OCENSETR_HSECSSON_Msk                         /*!< HSECSSON bit set */

/* Bit fields for RCC_OCENCLRR register */
#define RCC_OCENCLRR_HSION_Pos                     (0U)
#define RCC_OCENCLRR_HSION_Msk                     (0x1UL << RCC_OCENCLRR_HSION_Pos)                    /*!< 0x00000001 */
#define RCC_OCENCLRR_HSION                         RCC_OCENCLRR_HSION_Msk                            /*!< HSION bit clear */
#define RCC_OCENCLRR_HSIKERON_Pos                  (1U)
#define RCC_OCENCLRR_HSIKERON_Msk                  (0x1UL << RCC_OCENCLRR_HSIKERON_Pos)                 /*!< 0x00000002 */
#define RCC_OCENCLRR_HSIKERON                      RCC_OCENCLRR_HSIKERON_Msk                         /*!< HSIKERON bit clear */
#define RCC_OCENCLRR_MSION_Pos                     (2U)
#define RCC_OCENCLRR_MSION_Msk                     (0x1UL << RCC_OCENCLRR_MSION_Pos)                    /*!< 0x00000004 */
#define RCC_OCENCLRR_MSION                         RCC_OCENCLRR_MSION_Msk                            /*!< MSION bit clear */
#define RCC_OCENCLRR_MSIKERON_Pos                  (3U)
#define RCC_OCENCLRR_MSIKERON_Msk                  (0x1UL << RCC_OCENCLRR_MSIKERON_Pos)                 /*!< 0x00000008 */
#define RCC_OCENCLRR_MSIKERON                      RCC_OCENCLRR_MSIKERON_Msk                         /*!< MSIKERON bit clear */
#define RCC_OCENCLRR_HSEDIV2ON_Pos                 (5U)
#define RCC_OCENCLRR_HSEDIV2ON_Msk                 (0x1UL << RCC_OCENCLRR_HSEDIV2ON_Pos)                /*!< 0x00000020 */
#define RCC_OCENCLRR_HSEDIV2ON                     RCC_OCENCLRR_HSEDIV2ON_Msk                        /*!< HSEDIV2ON bit clear */
#define RCC_OCENCLRR_HSEDIV2BYP_Pos                (6U)
#define RCC_OCENCLRR_HSEDIV2BYP_Msk                (0x1UL << RCC_OCENCLRR_HSEDIV2BYP_Pos)               /*!< 0x00000040 */
#define RCC_OCENCLRR_HSEDIV2BYP                    RCC_OCENCLRR_HSEDIV2BYP_Msk                       /*!< HSEDIV2BYP bit clear */
#define RCC_OCENCLRR_HSEDIGBYP_Pos                 (7U)
#define RCC_OCENCLRR_HSEDIGBYP_Msk                 (0x1UL << RCC_OCENCLRR_HSEDIGBYP_Pos)                /*!< 0x00000080 */
#define RCC_OCENCLRR_HSEDIGBYP                     RCC_OCENCLRR_HSEDIGBYP_Msk                        /*!< HSEDIGBYP bit clear */
#define RCC_OCENCLRR_HSEON_Pos                     (8U)
#define RCC_OCENCLRR_HSEON_Msk                     (0x1UL << RCC_OCENCLRR_HSEON_Pos)                    /*!< 0x00000100 */
#define RCC_OCENCLRR_HSEON                         RCC_OCENCLRR_HSEON_Msk                            /*!< HSEON bit clear */
#define RCC_OCENCLRR_HSEKERON_Pos                  (9U)
#define RCC_OCENCLRR_HSEKERON_Msk                  (0x1UL << RCC_OCENCLRR_HSEKERON_Pos)                 /*!< 0x00000200 */
#define RCC_OCENCLRR_HSEKERON                      RCC_OCENCLRR_HSEKERON_Msk                         /*!< HSEKERON bit clear */
#define RCC_OCENCLRR_HSEBYP_Pos                    (10U)
#define RCC_OCENCLRR_HSEBYP_Msk                    (0x1UL << RCC_OCENCLRR_HSEBYP_Pos)                   /*!< 0x00000400 */
#define RCC_OCENCLRR_HSEBYP                        RCC_OCENCLRR_HSEBYP_Msk                           /*!< HSEBYP bit clear */

/******************  Bit fields for RCC_OCRDYR register  ******************/
#define RCC_OCRDYR_HSIRDY_Pos                    (0U)
#define RCC_OCRDYR_HSIRDY_Msk                    (0x1UL << RCC_OCRDYR_HSIRDY_Pos)                   /*!< 0x00000001 */
#define RCC_OCRDYR_HSIRDY                        RCC_OCRDYR_HSIRDY_Msk                             /*!< HSI clock ready flag */
#define RCC_OCRDYR_MSIRDY_Pos                    (2U)
#define RCC_OCRDYR_MSIRDY_Msk                    (0x1UL << RCC_OCRDYR_MSIRDY_Pos)                   /*!< 0x00000004 */
#define RCC_OCRDYR_MSIRDY                        RCC_OCRDYR_MSIRDY_Msk                             /*!< MSI clock ready flag */
#define RCC_OCRDYR_HSERDY_Pos                    (8U)
#define RCC_OCRDYR_HSERDY_Msk                    (0x1UL << RCC_OCRDYR_HSERDY_Pos)                   /*!< 0x00000100 */
#define RCC_OCRDYR_HSERDY                        RCC_OCRDYR_HSERDY_Msk                             /*!< HSE clock ready flag */
#define RCC_OCRDYR_CKREST_Pos                    (25U)
#define RCC_OCRDYR_CKREST_Msk                    (0x1UL << RCC_OCRDYR_CKREST_Pos)                   /*!< 0x02000000 */
#define RCC_OCRDYR_CKREST                        RCC_OCRDYR_CKREST_Msk                             /*!< Clock restore state machine status */

/* Bit fields for RCC_HSICFGR register  ******************/
#define RCC_HSICFGR_HSITRIM_Pos                    (8U)
#define RCC_HSICFGR_HSITRIM_Msk                    (0x7FUL << RCC_HSICFGR_HSITRIM_Pos)                  /*!< 0x00007F00 */
#define RCC_HSICFGR_HSITRIM                        RCC_HSICFGR_HSITRIM_Msk                           /*!< HSI clock trimming */
#define RCC_HSICFGR_HSICAL_Pos                     (16U)
#define RCC_HSICFGR_HSICAL_Msk                     (0x1FFUL << RCC_HSICFGR_HSICAL_Pos)                  /*!< 0x01FF0000 */
#define RCC_HSICFGR_HSICAL                         RCC_HSICFGR_HSICAL_Msk                            /*!< HSI clock calibration */

/* Bit fields for RCC_MSICFGR register  ******************/
#define RCC_MSICFGR_MSITRIM_Pos                    (8U)
#define RCC_MSICFGR_MSITRIM_Msk                    (0x1FUL << RCC_MSICFGR_MSITRIM_Pos)                  /*!< 0x00001F00 */
#define RCC_MSICFGR_MSITRIM                        RCC_MSICFGR_MSITRIM_Msk                           /*!< MSI clock trimming */
#define RCC_MSICFGR_MSICAL_Pos                     (16U)
#define RCC_MSICFGR_MSICAL_Msk                     (0xFFUL << RCC_MSICFGR_MSICAL_Pos)                   /*!< 0x00FF0000 */
#define RCC_MSICFGR_MSICAL                         RCC_MSICFGR_MSICAL_Msk                            /*!< MSI clock calibration */

/******************  Bit fields for RCC_LSICR register */
#define RCC_LSICR_LSION_Pos                      (0U)
#define RCC_LSICR_LSION_Msk                      (0x1UL << RCC_LSICR_LSION_Pos)                     /*!< 0x00000001 */
#define RCC_LSICR_LSION                          RCC_LSICR_LSION_Msk                               /*!< LSI oscillator enabled */
#define RCC_LSICR_LSIRDY_Pos                     (1U)
#define RCC_LSICR_LSIRDY_Msk                     (0x1UL << RCC_LSICR_LSIRDY_Pos)                    /*!< 0x00000002 */
#define RCC_LSICR_LSIRDY                         RCC_LSICR_LSIRDY_Msk                              /*!< LSI oscillator ready */

/* Bit fields for RCC_RTCDIVR register  ******************/
#define RCC_RTCDIVR_RTCDIV_Pos                   (0U)
#define RCC_RTCDIVR_RTCDIV_Msk                   (0x3FUL << RCC_RTCDIVR_RTCDIV_Pos)                   /*!< 0x0000003F */
#define RCC_RTCDIVR_RTCDIV                       RCC_RTCDIVR_RTCDIV_Msk                            /*!< HSE division factor for RTC clock */

/* Bit fields for RCC_APB1DIVR register */
#define RCC_APB1DIVR_APB1DIV_Pos                   (0U)
#define RCC_APB1DIVR_APB1DIV_Msk                   (0x7UL << RCC_APB1DIVR_APB1DIV_Pos)                  /*!< 0x00000007 */
#define RCC_APB1DIVR_APB1DIV                       RCC_APB1DIVR_APB1DIV_Msk                          /*!< APB1 clock divider */
#define RCC_APB1DIVR_APB1DIVRDY_Pos                (31U)
#define RCC_APB1DIVR_APB1DIVRDY_Msk                (0x1UL << RCC_APB1DIVR_APB1DIVRDY_Pos)               /*!< 0x80000000 */
#define RCC_APB1DIVR_APB1DIVRDY                    RCC_APB1DIVR_APB1DIVRDY_Msk                       /*!< APB1 clock prescaler status */

/* Bit fields for RCC_APB2DIVR register */
#define RCC_APB2DIVR_APB2DIV_Pos                   (0U)
#define RCC_APB2DIVR_APB2DIV_Msk                   (0x7UL << RCC_APB2DIVR_APB2DIV_Pos)                  /*!< 0x00000007 */
#define RCC_APB2DIVR_APB2DIV                       RCC_APB2DIVR_APB2DIV_Msk                          /*!< APB2 clock divider */
#define RCC_APB2DIVR_APB2DIVRDY_Pos                (31U)
#define RCC_APB2DIVR_APB2DIVRDY_Msk                (0x1UL << RCC_APB2DIVR_APB2DIVRDY_Pos)               /*!< 0x80000000 */
#define RCC_APB2DIVR_APB2DIVRDY                    RCC_APB2DIVR_APB2DIVRDY_Msk                       /*!< APB2 clock prescaler status */

/* Bit fields for RCC_APB3DIVR register */
#define RCC_APB3DIVR_APB3DIV_Pos                   (0U)
#define RCC_APB3DIVR_APB3DIV_Msk                   (0x7UL << RCC_APB3DIVR_APB3DIV_Pos)                  /*!< 0x00000007 */
#define RCC_APB3DIVR_APB3DIV                       RCC_APB3DIVR_APB3DIV_Msk                          /*!< APB3 clock divider */
#define RCC_APB3DIVR_APB3DIVRDY_Pos                (31U)
#define RCC_APB3DIVR_APB3DIVRDY_Msk                (0x1UL << RCC_APB3DIVR_APB3DIVRDY_Pos)               /*!< 0x80000000 */
#define RCC_APB3DIVR_APB3DIVRDY                    RCC_APB3DIVR_APB3DIVRDY_Msk                       /*!< APB3 clock prescaler status */

/* Bit fields for RCC_APB4DIVR register */
#define RCC_APB4DIVR_APB4DIV_Pos                   (0U)
#define RCC_APB4DIVR_APB4DIV_Msk                   (0x7UL << RCC_APB4DIVR_APB4DIV_Pos)                  /*!< 0x00000007 */
#define RCC_APB4DIVR_APB4DIV                       RCC_APB4DIVR_APB4DIV_Msk                          /*!< APB4 clock divider */
#define RCC_APB4DIVR_APB4DIVRDY_Pos                (31U)
#define RCC_APB4DIVR_APB4DIVRDY_Msk                (0x1UL << RCC_APB4DIVR_APB4DIVRDY_Pos)               /*!< 0x80000000 */
#define RCC_APB4DIVR_APB4DIVRDY                    RCC_APB4DIVR_APB4DIVRDY_Msk                       /*!< APB4 clock divider status */

/* Bit fields for RCC_APB5DIVR register */
#define RCC_APB5DIVR_APB5DIV_Pos                   (0U)
#define RCC_APB5DIVR_APB5DIV_Msk                   (0x7UL << RCC_APB5DIVR_APB5DIV_Pos)                  /*!< 0x00000007 */
#define RCC_APB5DIVR_APB5DIV                       RCC_APB5DIVR_APB5DIV_Msk                          /*!< APB5 clock divider */
#define RCC_APB5DIVR_APB5DIVRDY_Pos                (31U)
#define RCC_APB5DIVR_APB5DIVRDY_Msk                (0x1UL << RCC_APB5DIVR_APB5DIVRDY_Pos)               /*!< 0x80000000 */
#define RCC_APB5DIVR_APB5DIVRDY                    RCC_APB5DIVR_APB5DIVRDY_Msk                       /*!< APB5 clock divider status */

/* Bit fields for RCC_APBDBGDIVR register */
#define RCC_APBDBGDIVR_APBDBGDIV_Pos               (0U)
#define RCC_APBDBGDIVR_APBDBGDIV_Msk               (0x7UL << RCC_APBDBGDIVR_APBDBGDIV_Pos)              /*!< 0x00000007 */
#define RCC_APBDBGDIVR_APBDBGDIV                   RCC_APBDBGDIVR_APBDBGDIV_Msk                      /*!< APBDBG clock divider */
#define RCC_APBDBGDIVR_APBDBGDIVRDY_Pos            (31U)
#define RCC_APBDBGDIVR_APBDBGDIVRDY_Msk            (0x1UL << RCC_APBDBGDIVR_APBDBGDIVRDY_Pos)           /*!< 0x80000000 */
#define RCC_APBDBGDIVR_APBDBGDIVRDY                RCC_APBDBGDIVR_APBDBGDIVRDY_Msk                   /*!< APBDBG clock divider status */

/* Bit fields for RCC_TIMG1PRER register */
#define RCC_TIMG1PRER_TIMG1PRE_Pos                 (0U)
#define RCC_TIMG1PRER_TIMG1PRE_Msk                 (0x1UL << RCC_TIMG1PRER_TIMG1PRE_Pos)                /*!< 0x00000001 */
#define RCC_TIMG1PRER_TIMG1PRE                     RCC_TIMG1PRER_TIMG1PRE_Msk                        /*!< Clock prescaler selection for timers of group 1 */
#define RCC_TIMG1PRER_TIMG1PRERDY_Pos              (31U)
#define RCC_TIMG1PRER_TIMG1PRERDY_Msk              (0x1UL << RCC_TIMG1PRER_TIMG1PRERDY_Pos)             /*!< 0x80000000 */
#define RCC_TIMG1PRER_TIMG1PRERDY                  RCC_TIMG1PRER_TIMG1PRERDY_Msk                     /*!< Clock prescaler status for timers of group 1 */

/* Bit fields for RCC_TIMG2PRER register */
#define RCC_TIMG2PRER_TIMG2PRE_Pos                 (0U)
#define RCC_TIMG2PRER_TIMG2PRE_Msk                 (0x1UL << RCC_TIMG2PRER_TIMG2PRE_Pos)                /*!< 0x00000001 */
#define RCC_TIMG2PRER_TIMG2PRE                     RCC_TIMG2PRER_TIMG2PRE_Msk                        /*!< Clock prescaler selection for timers of group 2 */
#define RCC_TIMG2PRER_TIMG2PRERDY_Pos              (31U)
#define RCC_TIMG2PRER_TIMG2PRERDY_Msk              (0x1UL << RCC_TIMG2PRER_TIMG2PRERDY_Pos)             /*!< 0x80000000 */
#define RCC_TIMG2PRER_TIMG2PRERDY                  RCC_TIMG2PRER_TIMG2PRERDY_Msk                     /*!< Clock prescaler status for timers of group 2 */

