zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp211axx_cm33.h
/******************  Bit definition for SYSCFG_CBR register  ******************/
#define SYSCFG_CBR_CLL_Pos                                            (0U)
#define SYSCFG_CBR_CLL_Msk                                            (0x1UL << SYSCFG_CBR_CLL_Pos)                                              /*!< 0x00000001 */
#define SYSCFG_CBR_CLL                                                SYSCFG_CBR_CLL_Msk                                                        /*!< Cortex-M33 LOCKUP (HardFault) output enable */
#define SYSCFG_CBR_PVDL_Pos                                           (2U)
#define SYSCFG_CBR_PVDL_Msk                                           (0x1UL << SYSCFG_CBR_PVDL_Pos)                                             /*!< 0x00000004 */
#define SYSCFG_CBR_PVDL                                               SYSCFG_CBR_PVDL_Msk                                                       /*!< PVD lock enable */
#define SYSCFG_CBR_BKRAML_Pos                                         (3U)
#define SYSCFG_CBR_BKRAML_Msk                                         (0x1UL << SYSCFG_CBR_BKRAML_Pos)                                           /*!< 0x00000008 */
#define SYSCFG_CBR_BKRAML                                             SYSCFG_CBR_BKRAML_Msk                                                     /*!< BKPSRAM double ECC error lock */
#define SYSCFG_CBR_RETRAML_Pos                                        (4U)
#define SYSCFG_CBR_RETRAML_Msk                                        (0x1UL << SYSCFG_CBR_RETRAML_Pos)                                          /*!< 0x00000010 */
#define SYSCFG_CBR_RETRAML                                            SYSCFG_CBR_RETRAML_Msk                                                    /*!< RETRAM double ECC error lock */

/*************  Bit definition for SYSCFG_DISPLAYCLKCR register  **************/
#define SYSCFG_DISPLAYCLKCR_PIXEL_CLK_SEL_Pos                         (0U)
#define SYSCFG_DISPLAYCLKCR_PIXEL_CLK_SEL_Msk                         (0x3UL << SYSCFG_DISPLAYCLKCR_PIXEL_CLK_SEL_Pos)                           /*!< 0x00000003 */
#define SYSCFG_DISPLAYCLKCR_PIXEL_CLK_SEL                             SYSCFG_DISPLAYCLKCR_PIXEL_CLK_SEL_Msk                                     /*!< Control of pixel clock output selection */

/**************  Bit definition for SYSCFG_HDPUSBDBGCR register  **************/
#define SYSCFG_HDPUSBDBGCR_SELUSBDBG_Pos                              (0U)
#define SYSCFG_HDPUSBDBGCR_SELUSBDBG_Msk                              (0x1UL << SYSCFG_HDPUSBDBGCR_SELUSBDBG_Pos)                                /*!< 0x00000001 */
#define SYSCFG_HDPUSBDBGCR_SELUSBDBG                                  SYSCFG_HDPUSBDBGCR_SELUSBDBG_Msk                                          /*!< Selects debug signals to be routed to the Hardware Debug Port */

/******************  Bit definition for SYSCFG_IDC register  ******************/
#define SYSCFG_IDC_DEV_ID_Pos                                         (0U)
#define SYSCFG_IDC_DEV_ID_Msk                                         (0xFFFUL << SYSCFG_IDC_DEV_ID_Pos)                                         /*!< 0x00000FFF */
#define SYSCFG_IDC_DEV_ID                                             SYSCFG_IDC_DEV_ID_Msk                                                     /*!< Device ID */
#define SYSCFG_IDC_REV_ID_Pos                                         (16U)
#define SYSCFG_IDC_REV_ID_Msk                                         (0xFFFFUL << SYSCFG_IDC_REV_ID_Pos)                                        /*!< 0xFFFF0000 */
#define SYSCFG_IDC_REV_ID                                             SYSCFG_IDC_REV_ID_Msk                                                     /*!< Device revision */

/*****************  Bit definition for SYSCFG_VERR register  ******************/
#define SYSCFG_VERR_MINREV_Pos                                        (0U)
#define SYSCFG_VERR_MINREV_Msk                                        (0xFUL << SYSCFG_VERR_MINREV_Pos)                                          /*!< 0x0000000F */
#define SYSCFG_VERR_MINREV                                            SYSCFG_VERR_MINREV_Msk                                                    /*!< SYSCFG minor revision */
#define SYSCFG_VERR_MAJREV_Pos                                        (4U)
#define SYSCFG_VERR_MAJREV_Msk                                        (0xFUL << SYSCFG_VERR_MAJREV_Pos)                                          /*!< 0x000000F0 */
#define SYSCFG_VERR_MAJREV                                            SYSCFG_VERR_MAJREV_Msk                                                    /*!< SYSCFG major revision */

/*****************  Bit definition for SYSCFG_IPIDR register  *****************/
#define SYSCFG_IPIDR_ID_Pos                                           (0U)
#define SYSCFG_IPIDR_ID_Msk                                           (0xFFFFFFFFUL << SYSCFG_IPIDR_ID_Pos)                                      /*!< 0xFFFFFFFF */
#define SYSCFG_IPIDR_ID                                               SYSCFG_IPIDR_ID_Msk                                                       /*!< SYSCFG identifier */

/*****************  Bit definition for SYSCFG_SIDR register  ******************/
#define SYSCFG_SIDR_SID_Pos                                           (0U)
#define SYSCFG_SIDR_SID_Msk                                           (0xFFFFFFFFUL << SYSCFG_SIDR_SID_Pos)                                      /*!< 0xFFFFFFFF */
#define SYSCFG_SIDR_SID                                               SYSCFG_SIDR_SID_Msk                                                       /*!< Size identification */

/******************************************************************************/
/*                                                                            */
/*                     Tamper and backup register (TAMP)                      */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for TAMP_CR1 register  *****************/
#define TAMP_CR1_TAMP1E_Pos          (0U)
#define TAMP_CR1_TAMP1E_Msk          (0x1UL << TAMP_CR1_TAMP1E_Pos)                      /*!< 0x00000001U */
#define TAMP_CR1_TAMP1E              TAMP_CR1_TAMP1E_Msk
#define TAMP_CR1_TAMP2E_Pos          (1U)
#define TAMP_CR1_TAMP2E_Msk          (0x1UL << TAMP_CR1_TAMP2E_Pos)                      /*!< 0x00000002U */
#define TAMP_CR1_TAMP2E              TAMP_CR1_TAMP2E_Msk
#define TAMP_CR1_TAMP3E_Pos          (2U)
#define TAMP_CR1_TAMP3E_Msk          (0x1UL << TAMP_CR1_TAMP3E_Pos)                      /*!< 0x00000004U */
#define TAMP_CR1_TAMP3E              TAMP_CR1_TAMP3E_Msk
#define TAMP_CR1_TAMP4E_Pos          (3U)
#define TAMP_CR1_TAMP4E_Msk          (0x1UL << TAMP_CR1_TAMP4E_Pos)                      /*!< 0x00000008U */
#define TAMP_CR1_TAMP4E              TAMP_CR1_TAMP4E_Msk
#define TAMP_CR1_TAMP5E_Pos          (4U)
#define TAMP_CR1_TAMP5E_Msk          (0x1UL << TAMP_CR1_TAMP5E_Pos)                      /*!< 0x00000010U */
#define TAMP_CR1_TAMP5E              TAMP_CR1_TAMP5E_Msk
#define TAMP_CR1_TAMP6E_Pos          (5U)
#define TAMP_CR1_TAMP6E_Msk          (0x1UL << TAMP_CR1_TAMP6E_Pos)                      /*!< 0x00000020U */
#define TAMP_CR1_TAMP6E              TAMP_CR1_TAMP6E_Msk
#define TAMP_CR1_TAMP7E_Pos          (6U)
#define TAMP_CR1_TAMP7E_Msk          (0x1UL << TAMP_CR1_TAMP7E_Pos)                      /*!< 0x00000040U */
#define TAMP_CR1_TAMP7E              TAMP_CR1_TAMP7E_Msk
#define TAMP_CR1_ITAMP1E_Pos         (16U)
#define TAMP_CR1_ITAMP1E_Msk         (0x1UL << TAMP_CR1_ITAMP1E_Pos)                     /*!< 0x00010000U */
#define TAMP_CR1_ITAMP1E             TAMP_CR1_ITAMP1E_Msk
#define TAMP_CR1_ITAMP2E_Pos         (17U)
#define TAMP_CR1_ITAMP2E_Msk         (0x1UL << TAMP_CR1_ITAMP2E_Pos)                     /*!< 0x00040000U */
#define TAMP_CR1_ITAMP2E             TAMP_CR1_ITAMP2E_Msk
#define TAMP_CR1_ITAMP3E_Pos         (18U)
#define TAMP_CR1_ITAMP3E_Msk         (0x1UL << TAMP_CR1_ITAMP3E_Pos)                     /*!< 0x00040000U */
#define TAMP_CR1_ITAMP3E             TAMP_CR1_ITAMP3E_Msk
#define TAMP_CR1_ITAMP4E_Pos         (19U)
#define TAMP_CR1_ITAMP4E_Msk         (0x1UL << TAMP_CR1_ITAMP4E_Pos)                     /*!< 0x00080000U */
#define TAMP_CR1_ITAMP4E             TAMP_CR1_ITAMP4E_Msk
#define TAMP_CR1_ITAMP5E_Pos         (20U)
#define TAMP_CR1_ITAMP5E_Msk         (0x1UL << TAMP_CR1_ITAMP5E_Pos)                     /*!< 0x00100000U */
#define TAMP_CR1_ITAMP5E             TAMP_CR1_ITAMP5E_Msk
#define TAMP_CR1_ITAMP6E_Pos         (21U)
#define TAMP_CR1_ITAMP6E_Msk         (0x1UL << TAMP_CR1_ITAMP6E_Pos)                     /*!< 0x00200000U */
#define TAMP_CR1_ITAMP6E             TAMP_CR1_ITAMP6E_Msk
#define TAMP_CR1_ITAMP7E_Pos         (22U)
#define TAMP_CR1_ITAMP7E_Msk         (0x1UL << TAMP_CR1_ITAMP7E_Pos)                     /*!< 0x00400000U */
#define TAMP_CR1_ITAMP7E             TAMP_CR1_ITAMP7E_Msk
#define TAMP_CR1_ITAMP8E_Pos         (23U)
#define TAMP_CR1_ITAMP8E_Msk         (0x1UL << TAMP_CR1_ITAMP8E_Pos)                     /*!< 0x00800000U */
#define TAMP_CR1_ITAMP8E             TAMP_CR1_ITAMP8E_Msk
#define TAMP_CR1_ITAMP9E_Pos         (24U)
#define TAMP_CR1_ITAMP9E_Msk         (0x1UL << TAMP_CR1_ITAMP9E_Pos)                     /*!< 0x01000000U */
#define TAMP_CR1_ITAMP9E             TAMP_CR1_ITAMP9E_Msk
#define TAMP_CR1_ITAMP10E_Pos        (25U)
#define TAMP_CR1_ITAMP10E_Msk        (0x1UL << TAMP_CR1_ITAMP10E_Pos)                    /*!< 0x02000000U */
#define TAMP_CR1_ITAMP10E            TAMP_CR1_ITAMP10E_Msk
#define TAMP_CR1_ITAMP11E_Pos        (26U)
#define TAMP_CR1_ITAMP11E_Msk        (0x1UL << TAMP_CR1_ITAMP11E_Pos)                    /*!< 0x04000000U */
#define TAMP_CR1_ITAMP11E            TAMP_CR1_ITAMP11E_Msk
#define TAMP_CR1_ITAMP12E_Pos        (27U)
#define TAMP_CR1_ITAMP12E_Msk        (0x1UL << TAMP_CR1_ITAMP12E_Pos)                    /*!< 0x08000000U */
#define TAMP_CR1_ITAMP12E            TAMP_CR1_ITAMP12E_Msk
#define TAMP_CR1_ITAMP13E_Pos        (28U)
#define TAMP_CR1_ITAMP13E_Msk        (0x1UL << TAMP_CR1_ITAMP13E_Pos)                    /*!< 0x10000000U */
#define TAMP_CR1_ITAMP13E            TAMP_CR1_ITAMP13E_Msk
#define TAMP_CR1_ITAMP14E_Pos        (29U)
#define TAMP_CR1_ITAMP14E_Msk        (0x1UL << TAMP_CR1_ITAMP14E_Pos)                    /*!< 0x20000000U */
#define TAMP_CR1_ITAMP14E            TAMP_CR1_ITAMP14E_Msk
#define TAMP_CR1_ITAMP15E_Pos        (30U)
#define TAMP_CR1_ITAMP15E_Msk        (0x1UL << TAMP_CR1_ITAMP15E_Pos)                    /*!< 0x40000000U */
#define TAMP_CR1_ITAMP15E            TAMP_CR1_ITAMP15E_Msk
#define TAMP_CR1_ITAMP16E_Pos        (31U)
#define TAMP_CR1_ITAMP16E_Msk        (0x1UL << TAMP_CR1_ITAMP16E_Pos)                    /*!< 0x80000000U */
#define TAMP_CR1_ITAMP16E            TAMP_CR1_ITAMP16E_Msk

/********************  Bits definition for TAMP_CR2 register  *****************/
#define TAMP_CR2_TAMP1NOER_Pos       (0U)
#define TAMP_CR2_TAMP1NOER_Msk       (0x1UL << TAMP_CR2_TAMP1NOER_Pos)                   /*!< 0x00000001U */
#define TAMP_CR2_TAMP1NOER           TAMP_CR2_TAMP1NOER_Msk
#define TAMP_CR2_TAMP2NOER_Pos       (1U)
#define TAMP_CR2_TAMP2NOER_Msk       (0x1UL << TAMP_CR2_TAMP2NOER_Pos)                   /*!< 0x00000002U */
#define TAMP_CR2_TAMP2NOER           TAMP_CR2_TAMP2NOER_Msk
#define TAMP_CR2_TAMP3NOER_Pos       (2U)
#define TAMP_CR2_TAMP3NOER_Msk       (0x1UL << TAMP_CR2_TAMP3NOER_Pos)                   /*!< 0x00000004U */
#define TAMP_CR2_TAMP3NOER           TAMP_CR2_TAMP3NOER_Msk
#define TAMP_CR2_TAMP4NOER_Pos       (3U)
#define TAMP_CR2_TAMP4NOER_Msk       (0x1UL << TAMP_CR2_TAMP4NOER_Pos)                   /*!< 0x00000008U */
#define TAMP_CR2_TAMP4NOER           TAMP_CR2_TAMP4NOER_Msk
#define TAMP_CR2_TAMP5NOER_Pos       (4U)
#define TAMP_CR2_TAMP5NOER_Msk       (0x1UL << TAMP_CR2_TAMP5NOER_Pos)                   /*!< 0x00000010U */
#define TAMP_CR2_TAMP5NOER           TAMP_CR2_TAMP5NOER_Msk
#define TAMP_CR2_TAMP6NOER_Pos       (5U)
#define TAMP_CR2_TAMP6NOER_Msk       (0x1UL << TAMP_CR2_TAMP6NOER_Pos)                   /*!< 0x00000020U */
#define TAMP_CR2_TAMP6NOER           TAMP_CR2_TAMP6NOER_Msk
#define TAMP_CR2_TAMP7NOER_Pos       (6U)
#define TAMP_CR2_TAMP7NOER_Msk       (0x1UL << TAMP_CR2_TAMP7NOER_Pos)                   /*!< 0x00000040U */
#define TAMP_CR2_TAMP7NOER           TAMP_CR2_TAMP7NOER_Msk
#define TAMP_CR2_TAMP1MSK_Pos        (16U)
#define TAMP_CR2_TAMP1MSK_Msk        (0x1UL << TAMP_CR2_TAMP1MSK_Pos)                    /*!< 0x00010000U */
#define TAMP_CR2_TAMP1MSK            TAMP_CR2_TAMP1MSK_Msk
#define TAMP_CR2_TAMP2MSK_Pos        (17U)
#define TAMP_CR2_TAMP2MSK_Msk        (0x1UL << TAMP_CR2_TAMP2MSK_Pos)                    /*!< 0x00020000U */
#define TAMP_CR2_TAMP2MSK            TAMP_CR2_TAMP2MSK_Msk
#define TAMP_CR2_TAMP3MSK_Pos        (18U)
#define TAMP_CR2_TAMP3MSK_Msk        (0x1UL << TAMP_CR2_TAMP3MSK_Pos)                    /*!< 0x00040000U */
#define TAMP_CR2_TAMP3MSK            TAMP_CR2_TAMP3MSK_Msk
#define TAMP_CR2_BKERASE_Pos         (23U)
#define TAMP_CR2_BKERASE_Msk         (0x1UL << TAMP_CR2_BKERASE_Pos)                     /*!< 0x00800000U */
#define TAMP_CR2_BKERASE             TAMP_CR2_BKERASE_Msk
#define TAMP_CR2_TAMP1TRG_Pos        (24U)
#define TAMP_CR2_TAMP1TRG_Msk        (0x1UL << TAMP_CR2_TAMP1TRG_Pos)                    /*!< 0x01000000U */
#define TAMP_CR2_TAMP1TRG            TAMP_CR2_TAMP1TRG_Msk
#define TAMP_CR2_TAMP2TRG_Pos        (25U)
#define TAMP_CR2_TAMP2TRG_Msk        (0x1UL << TAMP_CR2_TAMP2TRG_Pos)                    /*!< 0x02000000U */
#define TAMP_CR2_TAMP2TRG            TAMP_CR2_TAMP2TRG_Msk
#define TAMP_CR2_TAMP3TRG_Pos        (26U)
#define TAMP_CR2_TAMP3TRG_Msk        (0x1UL << TAMP_CR2_TAMP3TRG_Pos)                    /*!< 0x04000000U */
#define TAMP_CR2_TAMP3TRG            TAMP_CR2_TAMP3TRG_Msk
#define TAMP_CR2_TAMP4TRG_Pos        (27U)
#define TAMP_CR2_TAMP4TRG_Msk        (0x1UL << TAMP_CR2_TAMP4TRG_Pos)                    /*!< 0x08000000U */
#define TAMP_CR2_TAMP4TRG            TAMP_CR2_TAMP4TRG_Msk
#define TAMP_CR2_TAMP5TRG_Pos        (28U)
#define TAMP_CR2_TAMP5TRG_Msk        (0x1UL << TAMP_CR2_TAMP5TRG_Pos)                    /*!< 0x10000000U */
#define TAMP_CR2_TAMP5TRG            TAMP_CR2_TAMP5TRG_Msk
#define TAMP_CR2_TAMP6TRG_Pos        (29U)
#define TAMP_CR2_TAMP6TRG_Msk        (0x1UL << TAMP_CR2_TAMP6TRG_Pos)                    /*!< 0x20000000U */
#define TAMP_CR2_TAMP6TRG            TAMP_CR2_TAMP6TRG_Msk
#define TAMP_CR2_TAMP7TRG_Pos        (30U)
#define TAMP_CR2_TAMP7TRG_Msk        (0x1UL << TAMP_CR2_TAMP7TRG_Pos)                    /*!< 0x40000000U */
#define TAMP_CR2_TAMP7TRG            TAMP_CR2_TAMP7TRG_Msk

/********************  Bits definition for TAMP_CR3 register  *****************/
#define TAMP_CR3_ITAMP1NOER_Pos      (0U)
#define TAMP_CR3_ITAMP1NOER_Msk      (0x1UL << TAMP_CR3_ITAMP1NOER_Pos)                  /*!< 0x00000001U */
#define TAMP_CR3_ITAMP1NOER          TAMP_CR3_ITAMP1NOER_Msk
#define TAMP_CR3_ITAMP2NOER_Pos      (1U)
#define TAMP_CR3_ITAMP2NOER_Msk      (0x1UL << TAMP_CR3_ITAMP2NOER_Pos)                  /*!< 0x00000002U */
#define TAMP_CR3_ITAMP2NOER          TAMP_CR3_ITAMP2NOER_Msk
#define TAMP_CR3_ITAMP3NOER_Pos      (2U)
#define TAMP_CR3_ITAMP3NOER_Msk      (0x1UL << TAMP_CR3_ITAMP3NOER_Pos)                  /*!< 0x00000004U */
#define TAMP_CR3_ITAMP3NOER          TAMP_CR3_ITAMP3NOER_Msk
#define TAMP_CR3_ITAMP4NOER_Pos      (3U)
#define TAMP_CR3_ITAMP4NOER_Msk      (0x1UL << TAMP_CR3_ITAMP4NOER_Pos)                  /*!< 0x00000008U */
#define TAMP_CR3_ITAMP4NOER          TAMP_CR3_ITAMP4NOER_Msk
#define TAMP_CR3_ITAMP5NOER_Pos      (4U)
#define TAMP_CR3_ITAMP5NOER_Msk      (0x1UL << TAMP_CR3_ITAMP5NOER_Pos)                  /*!< 0x00000010U */
#define TAMP_CR3_ITAMP5NOER          TAMP_CR3_ITAMP5NOER_Msk
#define TAMP_CR3_ITAMP6NOER_Pos      (5U)
#define TAMP_CR3_ITAMP6NOER_Msk      (0x1UL << TAMP_CR3_ITAMP6NOER_Pos)                  /*!< 0x00000020U */
#define TAMP_CR3_ITAMP6NOER          TAMP_CR3_ITAMP6NOER_Msk
#define TAMP_CR3_ITAMP7NOER_Pos      (6U)
#define TAMP_CR3_ITAMP7NOER_Msk      (0x1UL << TAMP_CR3_ITAMP7NOER)                      /*!< 0x00000040U */
#define TAMP_CR3_ITAMP7NOER          TAMP_CR3_ITAMP7NOER_Msk
#define TAMP_CR3_ITAMP8NOER_Pos      (7U)
#define TAMP_CR3_ITAMP8NOER_Msk      (0x1UL << TAMP_CR3_ITAMP8NOER_Pos)                  /*!< 0x00000080U */
#define TAMP_CR3_ITAMP8NOER          TAMP_CR3_ITAMP8NOER_Msk
#define TAMP_CR3_ITAMP9NOER_Pos      (8U)
#define TAMP_CR3_ITAMP9NOER_Msk      (0x1UL << TAMP_CR3_ITAMP9NOER_Pos)                  /*!< 0x00000100U */
#define TAMP_CR3_ITAMP9NOER          TAMP_CR3_ITAMP9NOER_Msk
#define TAMP_CR3_ITAMP10NOER_Pos     (9U)
#define TAMP_CR3_ITAMP10NOER_Msk     (0x1UL << TAMP_CR3_ITAMP10NOER_Pos)                 /*!< 0x00000200U */
#define TAMP_CR3_ITAMP10NOER         TAMP_CR3_ITAMP10NOER_Msk
#define TAMP_CR3_ITAMP11NOER_Pos     (10U)
#define TAMP_CR3_ITAMP11NOER_Msk     (0x1UL << TAMP_CR3_ITAMP11NOER_Pos)                 /*!< 0x00000400U */
#define TAMP_CR3_ITAMP11NOER         TAMP_CR3_ITAMP11NOER_Msk
#define TAMP_CR3_ITAMP12NOER_Pos     (11U)
#define TAMP_CR3_ITAMP12NOER_Msk     (0x1UL << TAMP_CR3_ITAMP12NOER_Pos)                 /*!< 0x00000800U */
#define TAMP_CR3_ITAMP12NOER         TAMP_CR3_ITAMP12NOER_Msk
#define TAMP_CR3_ITAMP13NOER_Pos     (12U)
#define TAMP_CR3_ITAMP13NOER_Msk     (0x1UL << TAMP_CR3_ITAMP13NOER_Pos)                 /*!< 0x00001000U */
#define TAMP_CR3_ITAMP13NOER         TAMP_CR3_ITAMP13NOER_Msk
#define TAMP_CR3_ITAMP14NOER_Pos     (13U)
#define TAMP_CR3_ITAMP14NOER_Msk     (0x1UL << TAMP_CR3_ITAMP14NOER_Pos)                 /*!< 0x00002000U */
#define TAMP_CR3_ITAMP14NOER         TAMP_CR3_ITAMP14NOER_Msk
#define TAMP_CR3_ITAMP15NOER_Pos     (14U)
#define TAMP_CR3_ITAMP15NOER_Msk     (0x1UL << TAMP_CR3_ITAMP15NOER_Pos)                 /*!< 0x00004000U */
#define TAMP_CR3_ITAMP15NOER         TAMP_CR3_ITAMP15NOER_Msk
#define TAMP_CR3_ITAMP16NOER_Pos     (15U)
#define TAMP_CR3_ITAMP16NOER_Msk     (0x1UL << TAMP_CR3_ITAMP16NOER_Pos)                 /*!< 0x00008000U */
#define TAMP_CR3_ITAMP16NOER         TAMP_CR3_ITAMP16NOER_Msk

/********************  Bits definition for TAMP_FLTCR register  ***************/
#define TAMP_FLTCR_TAMPFREQ_Pos      (0U)
#define TAMP_FLTCR_TAMPFREQ_Msk      (0x7UL << TAMP_FLTCR_TAMPFREQ_Pos)                  /*!< 0x00000007U */
#define TAMP_FLTCR_TAMPFREQ          TAMP_FLTCR_TAMPFREQ_Msk
#define TAMP_FLTCR_TAMPFREQ_0        (0x1UL << TAMP_FLTCR_TAMPFREQ_Pos)                  /*!< 0x00000001U */
#define TAMP_FLTCR_TAMPFREQ_1        (0x2UL << TAMP_FLTCR_TAMPFREQ_Pos)                  /*!< 0x00000002U */
#define TAMP_FLTCR_TAMPFREQ_2        (0x4UL << TAMP_FLTCR_TAMPFREQ_Pos)                  /*!< 0x00000004U */
#define TAMP_FLTCR_TAMPFLT_Pos       (3U)
#define TAMP_FLTCR_TAMPFLT_Msk       (0x3UL << TAMP_FLTCR_TAMPFLT_Pos)                   /*!< 0x00000018U */
#define TAMP_FLTCR_TAMPFLT           TAMP_FLTCR_TAMPFLT_Msk
#define TAMP_FLTCR_TAMPFLT_0         (0x1UL << TAMP_FLTCR_TAMPFLT_Pos)                   /*!< 0x00000008U */
#define TAMP_FLTCR_TAMPFLT_1         (0x2UL << TAMP_FLTCR_TAMPFLT_Pos)                   /*!< 0x00000010U */
#define TAMP_FLTCR_TAMPPRCH_Pos      (5U)
#define TAMP_FLTCR_TAMPPRCH_Msk      (0x3UL << TAMP_FLTCR_TAMPPRCH_Pos)                  /*!< 0x00000060U */
#define TAMP_FLTCR_TAMPPRCH          TAMP_FLTCR_TAMPPRCH_Msk
#define TAMP_FLTCR_TAMPPRCH_0        (0x1UL << TAMP_FLTCR_TAMPPRCH_Pos)                  /*!< 0x00000020U */
#define TAMP_FLTCR_TAMPPRCH_1        (0x2UL << TAMP_FLTCR_TAMPPRCH_Pos)                  /*!< 0x00000040U */
#define TAMP_FLTCR_TAMPPUDIS_Pos     (7U)
#define TAMP_FLTCR_TAMPPUDIS_Msk     (0x1UL << TAMP_FLTCR_TAMPPUDIS_Pos)                 /*!< 0x00000080U */
#define TAMP_FLTCR_TAMPPUDIS         TAMP_FLTCR_TAMPPUDIS_Msk

