zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp211axx_cm33.h
/******************  Bit definition for USART_BRR register  *******************/
#define USART_BRR_LPUART_Pos              (0U)
#define USART_BRR_LPUART_Msk              (0xFFFFFUL << USART_BRR_LPUART_Pos)   /*!< 0x000FFFFF */
#define USART_BRR_LPUART                  USART_BRR_LPUART_Msk           /*!< LPUART baud rate division (LPUARTDIV) */
#define USART_BRR_BRR_Pos                 (0U)
#define USART_BRR_BRR_Msk                 (0xFFFFUL << USART_BRR_BRR_Pos)  /*!< 0x0000FFFF */
#define USART_BRR_BRR                     USART_BRR_BRR_Msk           /*!< USART baud rate */

/******************  Bit definition for USART_GTPR register  ******************/
#define USART_GTPR_PSC_Pos             (0U)
#define USART_GTPR_PSC_Msk             (0xFFUL << USART_GTPR_PSC_Pos) /*!< 0x000000FF */
#define USART_GTPR_PSC                 USART_GTPR_PSC_Msk          /*!< Prescaler value */
#define USART_GTPR_GT_Pos              (8U)
#define USART_GTPR_GT_Msk              (0xFFUL << USART_GTPR_GT_Pos)/*!< 0x0000FF00 */
#define USART_GTPR_GT                  USART_GTPR_GT_Msk           /*!< Guard time value */

/*******************  Bit definition for USART_RTOR register  *****************/
#define USART_RTOR_RTO_Pos             (0U)
#define USART_RTOR_RTO_Msk             (0xFFFFFFUL << USART_RTOR_RTO_Pos)     /*!< 0x00FFFFFF */
#define USART_RTOR_RTO                 USART_RTOR_RTO_Msk          /*!< Receiver timeout value */
#define USART_RTOR_BLEN_Pos            (24U)
#define USART_RTOR_BLEN_Msk            (0xFFUL << USART_RTOR_BLEN_Pos)  /*!< 0xFF000000 */
#define USART_RTOR_BLEN                USART_RTOR_BLEN_Msk         /*!< Block Length  */

/*******************  Bit definition for USART_RQR register  ******************/
#define USART_RQR_ABRRQ_Pos            (0U)
#define USART_RQR_ABRRQ_Msk            (0x1UL << USART_RQR_ABRRQ_Pos) /*!< 0x00000001 */
#define USART_RQR_ABRRQ                USART_RQR_ABRRQ_Msk         /*!< Auto baud rate request */
#define USART_RQR_SBKRQ_Pos            (1U)
#define USART_RQR_SBKRQ_Msk            (0x1UL << USART_RQR_SBKRQ_Pos) /*!< 0x00000002 */
#define USART_RQR_SBKRQ                USART_RQR_SBKRQ_Msk         /*!< Send break request */
#define USART_RQR_MMRQ_Pos             (2U)
#define USART_RQR_MMRQ_Msk             (0x1UL << USART_RQR_MMRQ_Pos)/*!< 0x00000004 */
#define USART_RQR_MMRQ                 USART_RQR_MMRQ_Msk          /*!< Mute mode request */
#define USART_RQR_RXFRQ_Pos            (3U)
#define USART_RQR_RXFRQ_Msk            (0x1UL << USART_RQR_RXFRQ_Pos) /*!< 0x00000008 */
#define USART_RQR_RXFRQ                USART_RQR_RXFRQ_Msk         /*!< Receive data flush request */
#define USART_RQR_TXFRQ_Pos            (4U)
#define USART_RQR_TXFRQ_Msk            (0x1UL << USART_RQR_TXFRQ_Pos) /*!< 0x00000010 */
#define USART_RQR_TXFRQ                USART_RQR_TXFRQ_Msk         /*!< Transmit data flush request */

/*******************  Bit definition for USART_ISR register  ******************/
#define USART_ISR_PE_Pos               (0U)
#define USART_ISR_PE_Msk               (0x1UL << USART_ISR_PE_Pos)  /*!< 0x00000001 */
#define USART_ISR_PE                   USART_ISR_PE_Msk            /*!< Parity error */
#define USART_ISR_FE_Pos               (1U)
#define USART_ISR_FE_Msk               (0x1UL << USART_ISR_FE_Pos)  /*!< 0x00000002 */
#define USART_ISR_FE                   USART_ISR_FE_Msk            /*!< Framing error */
#define USART_ISR_NE_Pos               (2U)
#define USART_ISR_NE_Msk               (0x1UL << USART_ISR_NE_Pos)  /*!< 0x00000004 */
#define USART_ISR_NE                   USART_ISR_NE_Msk            /*!< Noise detection flag */
#define USART_ISR_ORE_Pos              (3U)
#define USART_ISR_ORE_Msk              (0x1UL << USART_ISR_ORE_Pos) /*!< 0x00000008 */
#define USART_ISR_ORE                  USART_ISR_ORE_Msk           /*!< Overrun error */
#define USART_ISR_IDLE_Pos             (4U)
#define USART_ISR_IDLE_Msk             (0x1UL << USART_ISR_IDLE_Pos)/*!< 0x00000010 */
#define USART_ISR_IDLE                 USART_ISR_IDLE_Msk          /*!< Idle line detected */
#define USART_ISR_RXFNE_Pos            (5U)
#define USART_ISR_RXFNE_Msk            (0x1UL << USART_ISR_RXFNE_Pos) /*!< 0x00000020 */
#define USART_ISR_RXFNE                USART_ISR_RXFNE_Msk         /*!< RXFIFO not empty */
#define USART_ISR_RXNE_RXFNE_Pos       USART_ISR_RXFNE_Pos
#define USART_ISR_RXNE_RXFNE_Msk       USART_ISR_RXFNE_Msk                        /*!< 0x00000020 */
#define USART_ISR_RXNE_RXFNE           USART_ISR_RXFNE_Msk                        /*!< Read Data Register or RX FIFO Not Empty */
#define USART_ISR_TC_Pos               (6U)
#define USART_ISR_TC_Msk               (0x1UL << USART_ISR_TC_Pos)  /*!< 0x00000040 */
#define USART_ISR_TC                   USART_ISR_TC_Msk            /*!< Transmission complete */
#define USART_ISR_TXFNF_Pos            (7U)
#define USART_ISR_TXFNF_Msk            (0x1UL << USART_ISR_TXFNF_Pos) /*!< 0x00000080 */
#define USART_ISR_TXFNF                USART_ISR_TXFNF_Pos         /*!< TXFIFO not full */
#define USART_ISR_TXE_TXFNF_Pos        USART_ISR_TXE_Pos
#define USART_ISR_TXE_TXFNF_Msk        USART_ISR_TXFNF_Msk                         /*!< 0x00000080 */
#define USART_ISR_TXE_TXFNF            USART_ISR_TXFNF_Msk                         /*!< Transmit Data Register Empty or TX FIFO Not Full Flag */
#define USART_ISR_LBDF_Pos             (8U)
#define USART_ISR_LBDF_Msk             (0x1UL << USART_ISR_LBDF_Pos)/*!< 0x00000100 */
#define USART_ISR_LBDF                 USART_ISR_LBDF_Msk          /*!< LIN break detection flag */
#define USART_ISR_CTSIF_Pos            (9U)
#define USART_ISR_CTSIF_Msk            (0x1UL << USART_ISR_CTSIF_Pos) /*!< 0x00000200 */
#define USART_ISR_CTSIF                USART_ISR_CTSIF_Msk         /*!< CTS interrupt flag */
#define USART_ISR_CTS_Pos              (10U)
#define USART_ISR_CTS_Msk              (0x1UL << USART_ISR_CTS_Pos) /*!< 0x00000400 */
#define USART_ISR_CTS                  USART_ISR_CTS_Msk           /*!< CTS flag */
#define USART_ISR_RTOF_Pos             (11U)
#define USART_ISR_RTOF_Msk             (0x1UL << USART_ISR_RTOF_Pos)/*!< 0x00000800 */
#define USART_ISR_RTOF                 USART_ISR_RTOF_Msk          /*!< Receiver timeout */
#define USART_ISR_EOBF_Pos             (12U)
#define USART_ISR_EOBF_Msk             (0x1UL << USART_ISR_EOBF_Pos)/*!< 0x00001000 */
#define USART_ISR_EOBF                 USART_ISR_EOBF_Msk          /*!< End of block flag */
#define USART_ISR_UDR_Pos              (13U)
#define USART_ISR_UDR_Msk              (0x1UL << USART_ISR_UDR_Pos) /*!< 0x00002000 */
#define USART_ISR_UDR                  USART_ISR_UDR_Msk           /*!< SPI slave underrun error flag */
#define USART_ISR_ABRE_Pos             (14U)
#define USART_ISR_ABRE_Msk             (0x1UL << USART_ISR_ABRE_Pos)/*!< 0x00004000 */
#define USART_ISR_ABRE                 USART_ISR_ABRE_Msk          /*!< Auto baud rate error */
#define USART_ISR_ABRF_Pos             (15U)
#define USART_ISR_ABRF_Msk             (0x1UL << USART_ISR_ABRF_Pos)/*!< 0x00008000 */
#define USART_ISR_ABRF                 USART_ISR_ABRF_Msk          /*!< Auto baud rate flag */
#define USART_ISR_BUSY_Pos             (16U)
#define USART_ISR_BUSY_Msk             (0x1UL << USART_ISR_BUSY_Pos)/*!< 0x00010000 */
#define USART_ISR_BUSY                 USART_ISR_BUSY_Msk          /*!< Busy flag */
#define USART_ISR_CMF_Pos              (17U)
#define USART_ISR_CMF_Msk              (0x1UL << USART_ISR_CMF_Pos) /*!< 0x00020000 */
#define USART_ISR_CMF                  USART_ISR_CMF_Msk           /*!< Character match flag */
#define USART_ISR_SBKF_Pos             (18U)
#define USART_ISR_SBKF_Msk             (0x1UL << USART_ISR_SBKF_Pos)/*!< 0x00040000 */
#define USART_ISR_SBKF                 USART_ISR_SBKF_Msk          /*!< Send break flag */
#define USART_ISR_RWU_Pos              (19U)
#define USART_ISR_RWU_Msk              (0x1UL << USART_ISR_RWU_Pos) /*!< 0x00080000 */
#define USART_ISR_RWU                  USART_ISR_RWU_Msk           /*!< Receiver wakeup from Mute mode */
#define USART_ISR_TEACK_Pos            (21U)
#define USART_ISR_TEACK_Msk            (0x1UL << USART_ISR_TEACK_Pos) /*!< 0x00200000 */
#define USART_ISR_TEACK                USART_ISR_TEACK_Msk         /*!< Transmit enable acknowledge flag  */
#define USART_ISR_REACK_Pos            (22U)
#define USART_ISR_REACK_Msk            (0x1UL << USART_ISR_REACK_Pos) /*!< 0x00400000 */
#define USART_ISR_REACK                USART_ISR_REACK_Msk         /*!< Receive enable acknowledge flag  */
#define USART_ISR_TXFE_Pos             (23U)
#define USART_ISR_TXFE_Msk             (0x1UL << USART_ISR_TXFE_Pos)/*!< 0x00800000 */
#define USART_ISR_TXFE                 USART_ISR_TXFE_Msk          /*!< TXFIFO Empty */
#define USART_ISR_RXFF_Pos             (24U)
#define USART_ISR_RXFF_Msk             (0x1UL << USART_ISR_RXFF_Pos)/*!< 0x01000000 */
#define USART_ISR_RXFF                 USART_ISR_RXFF_Msk          /*!< RXFIFO Full */
#define USART_ISR_TCBGT_Pos            (25U)
#define USART_ISR_TCBGT_Msk            (0x1UL << USART_ISR_TCBGT_Pos) /*!< 0x02000000 */
#define USART_ISR_TCBGT                USART_ISR_TCBGT_Msk         /*!< Transmission complete before guard time flag */
#define USART_ISR_RXFT_Pos             (26U)
#define USART_ISR_RXFT_Msk             (0x1UL << USART_ISR_RXFT_Pos)/*!< 0x04000000 */
#define USART_ISR_RXFT                 USART_ISR_RXFT_Msk          /*!< RXFIFO threshold flag */
#define USART_ISR_TXFT_Pos             (27U)
#define USART_ISR_TXFT_Msk             (0x1UL << USART_ISR_TXFT_Pos)/*!< 0x08000000 */
#define USART_ISR_TXFT                 USART_ISR_TXFT_Msk          /*!< TXFIFO threshold flag */

